---
node_id: 3468
title: '99.999 Is Not Enough: An OpenCloud Approach to Delivering Application Uptime and Performance'
type: whitepaper
created_date: '2013-05-15'
created_by: Rackspace Support
last_modified_date: '2015-07-21'
last_modified_by: Max Francisco
product: White Paper
product_url: white-paper
resource: 'https://www.rackspace.com/knowledge_center/sites/default/files/whitepaper_pdf/99.999 Is Not Enough.pdf'
---

<h3>Sum&aacute;rio executivo</h3>

<p>A press&atilde;o para se manter as aplica&ccedil;&otilde;es vitais on-line e um bom desempenho &eacute; extrema. Os riscos s&atilde;o altos; o tempo de inatividade da aplica&ccedil;&atilde;o significa perda de receita e a desacelera&ccedil;&atilde;o da aplica&ccedil;&atilde;o significa perda de clientes.<br />
<br />
Ao mesmo tempo, &eacute; dif&iacute;cil a obten&ccedil;&atilde;o da visibilidade de ambientes de produ&ccedil;&atilde;o de ponta a ponta, porque abrangem os centros de dados, fornecedores e at&eacute; mesmo as equipes de TI internas. &Agrave;s vezes, o &uacute;nico grupo que pode ajudar a solucionar problemas de uma aplica&ccedil;&atilde;o &eacute; a equipe de desenvolvimento; isso desvia o tempo de recursos importantes.<br />
<br />
Como resultado, os departamentos de TI continuam emperrados no presente, presos para manter a aplica&ccedil;&atilde;o instalada e funcionando, quando deveriam evitar os problemas do passado. Olhar estrategicamente para o futuro &eacute; um luxo que muitos n&atilde;o podem pagar, apesar das exig&ecirc;ncias constantes em TI pelo mais novo e mais recente.<br />
<br />
Neste white paper a CITO Research examina como os servi&ccedil;os de aplicativos essenciais da <a href="http://ptrackspace.convertlanguage.com/pt/enterprise_hosting/critical_applications/">Rackspace<sup>&reg;</sup> </a>podem ajudar os clientes a alcan&ccedil;ar a visibilidade de seus ambientes de aplica&ccedil;&otilde;es de ponta a ponta, manter o alto desempenho e ajudar a impedir que as aplica&ccedil;&otilde;es deixem de funcionar, tudo a um custo mensal razo&aacute;vel. Com a garantia de 100% de tempo de funcionamento da plataforma de produ&ccedil;&atilde;o, engenheiros web scale experientes na equipe oferecendo o <a href="http://ptrackspace.convertlanguage.com/pt/whyrackspace/support/">Suporte Fan&aacute;tico<sup>&reg;</sup></a> e ferramentas de monitoramento de classe empresarial da CA Technologies oferecendo a visibilidade de aplica&ccedil;&otilde;es e infraestrutura de ponta a ponta, os servi&ccedil;os de aplicativos essenciais da Rackspace s&atilde;o uma alternativa confi&aacute;vel e convincente para alcan&ccedil;ar o m&aacute;ximo desempenho da aplica&ccedil;&atilde;o.</p>

<h3>Introdu&ccedil;&atilde;o</h3>

<p>Um dos principais desafios que os departamentos de TI enfrentam atualmente &eacute; identificar e mitigar os problemas de desempenho de aplica&ccedil;&otilde;es. Quando perguntado sobre as quest&otilde;es mais cr&iacute;ticas enfrentadas pela TI em 2013, Sven Hammar, CEO da APICA, respondeu desta forma: "Como o uso da internet m&oacute;vel aumenta constantemente excedendo o uso do desktop e como as aplica&ccedil;&otilde;es web se tornam mais complexas, o monitoramento de aplicativos e, mais especificamente, a capacidade de detectar e localizar a origem dos problemas de desempenho ser&atilde;o um desafio para as organiza&ccedil;&otilde;es de TI. 2013 ser&aacute; o ano em que o monitoramento de desempenho mudar&aacute; o foco de apenas "Est&aacute; funcionando ou n&atilde;o?" para a presta&ccedil;&atilde;o de suporte &aacute;gil para o status de desempenho e a otimiza&ccedil;&atilde;o de aplica&ccedil;&otilde;es, tanto na nuvem quanto nas redes de empresas locais."<sup>1</sup><br />
<br />
Por que este desafio &eacute; t&atilde;o grande? Simplesmente porque as consequ&ecirc;ncias de n&atilde;o tratar o problema s&atilde;o maiores do que nunca. Se uma aplica&ccedil;&atilde;o que est&aacute; parada por uma hora resulta em perdas significativas na receita (US$ 500.000 a US$ 1 milh&otilde;es ou mais) ou danos colaterais para a marca, n&atilde;o pode haver d&uacute;vida de que o desempenho da aplica&ccedil;&atilde;o est&aacute; estressando significativamente o departamento de TI.<br />
<br />
Esses altos riscos mant&ecirc;m a TI amarrada no presente para manter as coisas funcionando e, no passado, garantindo que a falha infame do ano passado n&atilde;o volte a acontecer na nossa empresa.<br />
<br />
A tens&atilde;o de tentar manter tudo funcionando em face da demanda din&acirc;mica indica a necessidade de visibilidade de ponta a ponta nos ambientes. A visibilidade permitir&aacute; identificar problemas antes que eles se tornem problemas e tamb&eacute;m permitir&aacute; antecipar os picos de demanda e adicionar capacidade quando necess&aacute;rio.<br />
<br />
A CITO Research determinou que os departamentos de TI podem obter grandes ganhos de efici&ecirc;ncia ao trabalharem com um provedor de opera&ccedil;&otilde;es de gerenciamento qualificado. Neste documento, a CITO Research examina os servi&ccedil;os de aplicativos essenciais da Rackspace, que oferecem:</p>

<ul>
	<li>Garantia de 100% de tempo de funcionamento da plataforma de produ&ccedil;&atilde;o</li>
	<li>Engenheiros web-scale experientes</li>
	<li>Monitoramento de desempenho de aplica&ccedil;&atilde;o para aplica&ccedil;&otilde;es on-line para atender a alguns crit&eacute;rios</li>
</ul>

<p>Isso pode ser uma solu&ccedil;&atilde;o econ&ocirc;mica para os departamentos de TI das empresas com uma ou mais aplica&ccedil;&otilde;es cr&iacute;ticas.</p>

<h3>A tens&atilde;o nas aplica&ccedil;&otilde;es (e TI empresarial)</h3>

<p>Os departamentos de TI empresarial j&aacute; est&atilde;o estressados e isso, &agrave;s vezes, mostra-se em erros humanos evit&aacute;veis. Em 2015, 80% das interrup&ccedil;&otilde;es que afetar&atilde;o os servi&ccedil;os fundamentais ser&atilde;o causados por problemas de pessoas e processos, n&atilde;o por falha da tecnologia essencial, e mais de 50% desses problemas de pessoas/processo ser&atilde;o a integra&ccedil;&atilde;o da mudan&ccedil;a/configura&ccedil;&atilde;o/libera&ccedil;&atilde;o e as transfer&ecirc;ncias.<sup>2</sup> Os desenvolvedores de aplica&ccedil;&otilde;es cr&iacute;ticas muitas vezes se envolvem na manuten&ccedil;&atilde;o ou patching da infraestrutura, o que resulta em menos tempo para desenvolver a aplica&ccedil;&atilde;o que est&aacute; impulsionando a receita e maior desvio de recursos escassos.<br />
<br />
Al&eacute;m disso, os departamentos de TI devem ficar a par de uma enxurrada de novos desenvolvimentos em tecnologia, mantendo e apoiando um cen&aacute;rio de TI complexo existente. Muitas vezes, ningu&eacute;m tem uma vis&atilde;o de ponta a ponta da aplica&ccedil;&atilde;o nos ambientes. Estende-se por fornecedores, por infraestruturas (nuvem e no local) e por equipes de TI especializadas. Muitos departamentos de TI s&atilde;o divididos por especializa&ccedil;&atilde;o (um administrador de rede aqui, um DBA ali, um especialista em armazenamento acol&aacute;) e cada um conta com uma ferramenta otimizada para sua &aacute;rea individual. A manuten&ccedil;&atilde;o de uma aplica&ccedil;&atilde;o essencial muitas vezes exige que todas essas &aacute;reas se coordenem com os fornecedores e entre si.<br />
<br />
Quando h&aacute; problemas e fornecedores externos s&atilde;o trazidos para o local, os resultados s&atilde;o acusa&ccedil;&otilde;es. A vis&atilde;o de ponta a ponta &eacute; t&atilde;o grande, interdependente e din&acirc;mica que &eacute; dif&iacute;cil manter uma &uacute;nica fonte de informa&ccedil;&atilde;o sobre o assunto.<br />
<br />
Para finalizar, os gestores desonestos costumam driblar a TI e usar cart&otilde;es de cr&eacute;dito para financiar novas iniciativas em nuvem, aumentando ainda mais a complexidade do ambiente e reduzindo a visibilidade.<br />
<br />
Por fim, garantir o desempenho e o tempo de funcionamento da aplica&ccedil;&atilde;o gera uma carga pessoal pesada para a equipe de TI, que deve estar dispon&iacute;vel para oferecer suporte ap&oacute;s o expediente e nos feriados.</p>

<h3>Servi&ccedil;os de aplicativos essenciais da Rackspace: uma alternativa econ&ocirc;mica</h3>

<p>Uma solu&ccedil;&atilde;o de monitoramento de desempenho para um ambiente de produ&ccedil;&atilde;o interno que funcione 24 horas por dia, 7 dias por semana, 365 dias por ano pode facilmente custar US$ 500.000 iniciais, antes mesmo que algu&eacute;m comece a trabalhar. Uma empresa de consultoria ou integradora de sistemas poderia criar um ambiente de hospedagem e monitoramento de aplica&ccedil;&atilde;o por uma taxa de consultoria de v&aacute;rios milh&otilde;es de d&oacute;lares, al&eacute;m de um compromisso de seis meses e custos de licenciamento de cerca de US$ 250.000.<br />
<br />
Para oferecer uma alternativa econ&ocirc;mica, a Rackspace trabalhou com a CA Technologies para oferecer os servi&ccedil;os de aplicativos essenciais da Rackspace. As opera&ccedil;&otilde;es de TI melhoram quando os engenheiros web scale da Rackspace aumentam a equipe de TI interna, liberando-a para executar tarefas que contribuem para a inova&ccedil;&atilde;o e o crescimento de primeira linha.<br />
<br />
Os servi&ccedil;os de aplicativos essenciais fornecem uma garantia de 100% de tempo de funcionamento da plataforma de produ&ccedil;&atilde;o em ambientes aprovados de alta disponibilidade, algo que pouqu&iacute;ssimos departamentos de TI e provedores de hospedagem podem oferecer. (A garantia de tempo de funcionamento da plataforma de produ&ccedil;&atilde;o complementa a tradicional garantia de 100% de tempo de funcionamento de rede da Rackspace.) Usando as ferramentas de monitoramento da CA Technologies, os experientes engenheiros web scale da Rackspace monitoram e gerenciam todas as camadas da pilha, inclusive aplica&ccedil;&otilde;es, sistemas operacionais, servidores e redes. Essa experi&ecirc;ncia faz parte do Suporte Fan&aacute;tico: os funcion&aacute;rios se dedicam a garantir uma excelente experi&ecirc;ncia do cliente, est&atilde;o intimamente familiarizados com os ambientes dos clientes e atendem diretamente os seus telefonemas.</p>

<h3>Uma extens&atilde;o da equipe de IT</h3>

<p>Os servi&ccedil;os de aplicativos essenciais da Rackspace economizam tempo, dinheiro e esfor&ccedil;os do pessoal do departamento de TI, que faz de tudo para prestar suporte &agrave;s aplica&ccedil;&otilde;es de alto desempenho. Os departamentos de TI s&atilde;o vistos como centros de custos; no entanto, s&atilde;o sempre solicitados a fazer mais. Sobrecarregado com a manuten&ccedil;&atilde;o, configura&ccedil;&atilde;o e patching dos ativos de TI existentes, tamb&eacute;m espera-se que o departamento de TI ajude a empresa com o lan&ccedil;amento de apps em nuvem, sociais e m&oacute;veis do futuro, muitas vezes com o or&ccedil;amento a equipe do passado. Quando uma equipe experiente sai, nem sempre &eacute; substitu&iacute;da, e sua experi&ecirc;ncia e conhecimento saem com ela. Menos recursos significam cargas de trabalho mais pesadas, menos tempo e n&iacute;veis mais baixos de experi&ecirc;ncia da equipe. Sob press&atilde;o para fazer mais com menos, o departamento de TI se esfor&ccedil;a para gerenciar v&aacute;rios ambientes de fornecedores, inclusive uma barragem quase constante de patches, atualiza&ccedil;&otilde;es e pedidos de recursos, ao mesmo tempo em que faz malabarismos com os pedidos de neg&oacute;cios para lan&ccedil;ar novas aplica&ccedil;&otilde;es e servi&ccedil;os.<br />
<br />
Por exemplo: o conjunto de aplica&ccedil;&otilde;es da CA Technologies ajuda a Rackspace a identificar qualquer componente de aplica&ccedil;&atilde;o que cause problemas, mesmo os que n&atilde;o s&atilde;o de propriedade da Rackspace ou do cliente. Isso significa que o departamento de TI gasta menos tempo apagando inc&ecirc;ndios e mais tempo trabalhando em inova&ccedil;&otilde;es que impulsionam os neg&oacute;cios. Em vez de licenciar a CA Technologies ou uma plataforma semelhante e tentar implementar suas aplica&ccedil;&otilde;es em seu pr&oacute;prio hardware, com todo o tempo de manuten&ccedil;&atilde;o e suporte que isso implica, os clientes corporativos podem simplesmente implementar o suporte, ambiente gerenciado de opera&ccedil;&otilde;es e servi&ccedil;o de monitoramento como um pacote completo, deixando a Rackspace ser uma extens&atilde;o da equipe de TI, a parte dedicada a "manter as luzes acesas", o que diminui o estresse do departamento de TI. A Rackspace pode atender uma chamada &agrave;s 2 A.M. quando houver um problema com o seu ambiente de produ&ccedil;&atilde;o de alto n&iacute;vel, em vez de algu&eacute;m da sua equipe. Ray Velez, diretor global de tecnologia da Razorfish, afirmou: "A Rackspace n&atilde;o &eacute; apenas mais uma fornecedora; ela &eacute; nossa parceira e uma extens&atilde;o da nossa equipe. Ela trata as necessidades dos nossos clientes com m&aacute;xima prioridade e opera ao ritmo de uma ag&ecirc;ncia. As incont&aacute;veis horas que ela passa nos ajudando a arquitetar as solu&ccedil;&otilde;es certas e seu desejo de nos ajudar a trabalhar de forma mais eficiente &eacute; apenas uma pequena parte do seu Suporte Fan&aacute;tico de primeiro n&iacute;vel".</p>

<h3>Anatomia da garantia</h3>

<p>Os servi&ccedil;os de aplicativos essenciais da Rackspace oferecem uma equipe dedicada de engenheiros web scale, monitoramento do desempenho de infraestrutura e aplica&ccedil;&atilde;o e otimiza&ccedil;&atilde;o e orienta&ccedil;&atilde;o cont&iacute;nuas sobre as implementa&ccedil;&otilde;es. Sua abordagem em rela&ccedil;&atilde;o ao monitoramento da aplica&ccedil;&atilde;o e da infraestrutura &eacute; composta de tr&ecirc;s partes:<br />
&nbsp;</p>

<ul>
	<li><strong>Descoberta da infraestrutura.</strong> A equipe, com sua tecnologia, descobre automaticamente a infraestrutura e mapeia as rela&ccedil;&otilde;es entre a infraestrutura e as aplica&ccedil;&otilde;es atendidas. Esta etapa &eacute; fundamental para oferecer suporte de ponta a ponta. Ao ter uma imagem completa e atualizada da infraestrutura, a Rackspace pode aconselhar os desenvolvedores sobre as depend&ecirc;ncias quando novos componentes s&atilde;o implementados.</li>
	<li><strong>Monitoramento proativo de desempenho e an&aacute;lise da causa raiz.</strong> Usando os modelos de an&aacute;lise de causa raiz l&iacute;deres do setor da CA Technologies, os engenheiros web scale da Rackspace podem associar os limites e alarmes e prever problemas de desempenho com anteced&ecirc;ncia. A equipe pode identificar potenciais problemas em qualquer parte da pilha, da camada de transa&ccedil;&otilde;es e experi&ecirc;ncia do usu&aacute;rio final at&eacute; as comuta&ccedil;&otilde;es de rede. Caso o primeiro objetivo n&atilde;o seja cumprido, que &eacute; isolar e corrigir os problemas antes que o cliente atenda o telefone, a equipe ajudar&aacute; a priorizar, fazer a triagem, responder e corrigir o problema. Os servi&ccedil;os de aplicativos essenciais proporcionam &agrave; equipe de TI visibilidade de 360 graus em toda a aplica&ccedil;&atilde;o e pilha de hardware.</li>
	<li><strong>An&aacute;lise de tr&aacute;fego e planejamento preditivo de capacidade.</strong> A equipe trabalha para entender o comportamento da rede e da aplica&ccedil;&atilde;o, inclusive as taxas de consumo de aplica&ccedil;&atilde;o e de recursos, o que permite prever os congestionamentos de desempenho antes que eles aconte&ccedil;am. A Rackspace tamb&eacute;m trabalha com aquisi&ccedil;&otilde;es para fornecer dados concretos sobre o local onde os recursos ser&atilde;o necess&aacute;rios de acordo com as tend&ecirc;ncias da aplica&ccedil;&atilde;o. Esses dados tamb&eacute;m podem mostrar onde os recursos podem ser recolocados ou retirados caso a aplica&ccedil;&atilde;o receba recursos em excesso.</li>
</ul>

<p>A equipe de servi&ccedil;os de aplicativos essenciais da Rackspace tem desenvolvido solu&ccedil;&otilde;es de opera&ccedil;&otilde;es gerenciadas de alta disponibilidade com a CA Technologies h&aacute; v&aacute;rios anos e desenvolveu arquiteturas de refer&ecirc;ncia de alto desempenho que podem suportar uma ampla gama de aplica&ccedil;&otilde;es e infraestruturas, tanto <a href="http://ptrackspace.convertlanguage.com/pt/managed_hosting/dedicated_servers/">dedicadas</a> como <a href="http://ptrackspace.convertlanguage.com/pt/hosting_solutions/hybrid_hosting/">h&iacute;bridas</a>, no local e <a href="http://ptrackspace.convertlanguage.com/pt/cloud/">na nuvem</a>. Os servi&ccedil;os de aplicativos essenciais da Rackspace tamb&eacute;m incluem o suporte de plataformas particularmente desafiadoras, que exigem v&aacute;rias inst&acirc;ncias ou configura&ccedil;&atilde;o extensa. A figura 1 mostra como os servi&ccedil;os de aplicativos essenciais da Rackspace proporcionam visibilidade de ponta a ponta.<br />
<br />
<img alt="" height="346" src="https://8026b2e3760e2433679c-fffceaebb8c6ee053c935e8915a3fbe7.ssl.cf2.rackcdn.com/999notenough-1.png" width="585" /></p>

<h3>Capacidades da CA Technologies</h3>

<p>Embora seja poss&iacute;vel reunir um conjunto de ferramentas a partir do zero, &eacute; pouco prov&aacute;vel que isso seja mais barato ou mais r&aacute;pido do que por meio dos servi&ccedil;os de aplicativos essenciais. Pouqu&iacute;ssimas empresas t&ecirc;m a capacidade da CA Technologies para suportar tanto o gerenciamento de aplica&ccedil;&otilde;es com reconhecimento de rede quanto o gerenciamento de rede com reconhecimento da aplica&ccedil;&atilde;o que, juntos, oferecem um entendimento completo de como as demandas de aplica&ccedil;&atilde;o afetam o desempenho da rede e como diferentes configura&ccedil;&otilde;es de rede afetam as aplica&ccedil;&otilde;es.<br />
<br />
A CA Technologies est&aacute; presente em dez dos maiores bancos dos EUA, por um bom motivo. A empresa &eacute; conhecida por sua biblioteca de an&aacute;lise de causa raiz patenteada e baseada em modelos, com mais de 10.000 modelos de problemas predefinidos. Esses modelos s&atilde;o incorporados a cada componente do pacote da CA Technologies, e os engenheiros web scale da Rackspace s&atilde;o treinados para us&aacute;-los. Isso pode reduzir consideravelmente o tempo m&eacute;dio de reparo. Qualquer que seja o problema, provavelmente os engenheiros web scale da Rackspace j&aacute; o conhecem.</p>

<p>A Rackspace escolheu o pacote da CA Technologies por dois motivos:</p>

<ul>
	<li>Ele proporciona recursos para monitorar dos centros de dados, para que as aplica&ccedil;&otilde;es que cruzam os ambientes possam ser gerenciadas de maneira eficaz, oferecendo uma vis&atilde;o &uacute;nica do desempenho.</li>
	<li>Ele fornece recursos abrangentes para monitorar tudo o que os engenheiros web scale da Rackspace precisam ver, a fim de suportar a pilha completa de aplica&ccedil;&otilde;es.</li>
</ul>

<p>Como o pacote da CA Technologies &eacute; muito amplo, tamb&eacute;m &eacute; complexo e dif&iacute;cil de ser implementado por conta pr&oacute;pria. S&atilde;o necess&aacute;rios v&aacute;rios administradores e custos de licenciamento de software, al&eacute;m de manuten&ccedil;&atilde;o constante. O uso do pacote da CA Technologies foi incorporado &agrave; oferta dos servi&ccedil;os de aplicativos essenciais, que custam o equivalente a um funcion&aacute;rio de per&iacute;odo integral por ano.<sup>3</sup><br />
<br />
Os seguintes componentes do pacote da CA Technologies s&atilde;o incorporados &agrave; oferta de servi&ccedil;os de aplicativos essenciais da Rackspace:</p>

<ul>
	<li>Wiley &eacute; um componente de gerenciamento de desempenho de aplica&ccedil;&otilde;es (APM), que mede o desempenho da transa&ccedil;&atilde;o. O Wiley entende todas as consequ&ecirc;ncias de uma transa&ccedil;&atilde;o em uma determinada aplica&ccedil;&atilde;o, do usu&aacute;rio final at&eacute; o centro de dados. Ele pode examinar, analisar e determinar a causa raiz de falhas da transa&ccedil;&atilde;o, bem como detectar falhas potenciais e prever a degrada&ccedil;&atilde;o do desempenho.</li>
	<li>eHealth &eacute; uma solu&ccedil;&atilde;o de monitoramento de desempenho de rede (NPM) que rastreia a utiliza&ccedil;&atilde;o da largura de banda, a utiliza&ccedil;&atilde;o do processador e os erros no hardware, em n&iacute;vel de infraestrutura. O eHealth detecta e prev&ecirc; problemas com roteadores, comuta&ccedil;&otilde;es, servidores e balanceadores de carga e comunica os problemas que podem impedir o desempenho da aplica&ccedil;&atilde;o. A an&aacute;lise heur&iacute;stica de cada parte da infraestrutura em intervalos de tempo permite que a equipe observe como uma falha na infraestrutura pode afetar uma ou mais aplica&ccedil;&otilde;es, permitindo a aloca&ccedil;&atilde;o proativa de recursos que podem desencadear crises.</li>
	<li>O Spectrum &eacute; um agente de agrega&ccedil;&atilde;o e correla&ccedil;&atilde;o de eventos. O Spectrum modela toda a pilha de aplica&ccedil;&otilde;es e usa o modelo para identificar eventos e calcular o seu impacto. Ele coleta os alertas do hardware nativo e dos sistemas operacionais, bem como os sinais do Wiley e eHealth e isola a causa raiz dos problemas, que levaria horas para ser identificada por outros meios.</li>
</ul>

<h3>Experi&ecirc;ncia comprovada</h3>

<p>A equipe de servi&ccedil;os de aplicativos essenciais da Rackspace dedica-se inteiramente ao total entendimento dos requisitos de desempenho dos clientes, das necessidades do ambiente da aplica&ccedil;&atilde;o e das depend&ecirc;ncias e cria um plano adequado para monitorar e otimizar o desempenho de forma eficiente. Como resultado, o profissional de TI pode se concentrar em seus clientes e n&atilde;o em sua infraestrutura.<br />
<br />
A experi&ecirc;ncia da equipe da Rackspace, tanto na plataforma da CA Technologies como em todas as plataformas utilizadas na pilha, significa que a TI corporativa n&atilde;o precisa ficar no topo das mais recentes solu&ccedil;&otilde;es, patches e atualiza&ccedil;&otilde;es. A equipe experiente e as tecnologias comprovadas da Rackspace s&atilde;o validadas pela ind&uacute;stria. Com mais de 190.000 clientes e US$ 1 bilh&otilde;es em receita anual, a Rackspace &eacute; l&iacute;der do Quadrante M&aacute;gico do Gartner para provedores de hospedagem gerenciada, pelo sexto ano consecutivo. Com 190.000 clientes, os engenheiros web scale da Rackspace j&aacute; viram quase todos os tipos de problemas que voc&ecirc; possa imaginar e sabem como resolv&ecirc;-los.<br />
<br />
Como complemento proativo para os departamentos de TI, os servi&ccedil;os de aplicativos essenciais da Rackspace podem oferecer a agilidade necess&aacute;ria dos projetos iniciais ("startup"), com a visibilidade e o controle oferecidos pela CA Technologies, prevendo os picos de carga com at&eacute; tr&ecirc;s semanas de anteced&ecirc;ncia.<br />
<br />
Com o monitoramento de desempenho de aplica&ccedil;&atilde;o e rede de classe empresarial da CA Technologies, os clientes podem aproveitar essa combina&ccedil;&atilde;o de suporte, experi&ecirc;ncia e ferramentas, mantendo as aplica&ccedil;&otilde;es essenciais por um custo menor do que a aquisi&ccedil;&atilde;o de ferramentas de monitoramento de desempenho de aplica&ccedil;&atilde;o e rede por conta pr&oacute;pria. Em vez de ter um ambiente de servi&ccedil;o de TI compartilhado, a empresa tem uma equipe dedicada focada nos principais ambientes de produ&ccedil;&atilde;o. Em vez de acusa&ccedil;&otilde;es e atrasos na resolu&ccedil;&atilde;o de um problema complexo, em v&aacute;rias plataformas e com v&aacute;rios fornecedores, &eacute; poss&iacute;vel se comunicar por telefone, mesmo que seja &agrave;s 2 A.M., e, do outro lado da linha, h&aacute; sempre algu&eacute;m da Rackspace que conhece os detalhes da implementa&ccedil;&atilde;o espec&iacute;fica.<br />
<br />
Al&eacute;m de economizar dinheiro, a equipe de TI economiza tempo. Os servi&ccedil;os de aplicativos essenciais t&ecirc;m a visibilidade para identificar os problemas com precis&atilde;o, o que permite que sejam reparados o mais r&aacute;pido poss&iacute;vel, seja em decorr&ecirc;ncia de um relat&oacute;rio de SQL diferente ou da substitui&ccedil;&atilde;o de um servidor lento. Em vez de tentar assumir tudo com recursos limitados, a equipe de TI pode redirecionar seu valioso pessoal para projetos-chave, para promover os neg&oacute;cios e evitar que os desenvolvedores trabalhem na solu&ccedil;&atilde;o de problemas de infraestrutura.<br />
<br />
O fato &eacute; que, na maioria das vezes, a equipe de TI &eacute; constantemente for&ccedil;ada a permanecer no presente, mantendo tudo funcionando. Com a experi&ecirc;ncia dos servi&ccedil;os de aplicativos essenciais da Rackspace, a equipe de TI pode se concentrar no futuro e trabalhar em esfor&ccedil;os estrat&eacute;gicos e em projetos inovadores. (V&aacute;rios clientes dos servi&ccedil;os de aplicativos essenciais descobriram que agora t&ecirc;m tempo para criar os aplicativos para dispositivo m&oacute;vel que todos pedem.) A equipe de TI pode se concentrar na an&aacute;lise e dar recomenda&ccedil;&otilde;es aos neg&oacute;cios, em vez de simplesmente monitorar e coletar dados. Eles t&ecirc;m acesso aos engenheiros web scale experientes que falam a sua l&iacute;ngua e t&ecirc;m experi&ecirc;ncia nas ferramentas utilizadas. Em suma, a terceiriza&ccedil;&atilde;o do monitoramento do desempenho de aplica&ccedil;&otilde;es essenciais permite que os profissionais de TI durmam &agrave; noite. Para muitos, pode ser a primeira boa noite de sono ap&oacute;s um longo per&iacute;odo.</p>

<h3>Conclus&atilde;o</h3>

<p>Os usu&aacute;rios corporativos, parceiros e consumidores esperam gratifica&ccedil;&atilde;o imediata de suas aplica&ccedil;&otilde;es on-line, e a equipe de TI sofre toda a press&atilde;o. Sobrecarregados com os cortes de custos, agregando novas compet&ecirc;ncias, testando e configurando novos produtos e monitorando e mantendo as tecnologias que j&aacute; possuem, os departamentos de TI est&atilde;o estressados.<br />
<br />
A CITO Research determinou que os servi&ccedil;os de aplicativos essenciais da Rackspace s&atilde;o uma solu&ccedil;&atilde;o confi&aacute;vel e convincente, que transfere as tarefas mais trabalhosas e complexas de TI para um servi&ccedil;o mensal. Os servi&ccedil;os de aplicativos essenciais da Rackspace combinam um suporte e experi&ecirc;ncia de alto n&iacute;vel, que inclui a garantia de 100% de tempo de funcionamento da plataforma de produ&ccedil;&atilde;o, com engenheiros web scale experientes e a melhor tecnologia de monitoramento da categoria que, normalmente, est&aacute; fora do alcance de todos, exceto das grandes empresas. Com solu&ccedil;&otilde;es como esta em pr&aacute;tica, os departamentos de TI podem voltar a desenvolver e oferecer projetos inovadores que criam alto valor para as empresas, al&eacute;m de olhar para o futuro, planejando iniciativas estrat&eacute;gicas. Vashdev Vangani, gerente do departamento de Tecnologia da Informa&ccedil;&atilde;o da Mazda North American Operations, afirmou: "A equipe de servi&ccedil;os de aplicativos essenciais representa um enorme valor agregado para minha empresa. Antes, t&iacute;nhamos que reagir. Agora, podemos expandir de forma proativa para a demanda futura".<br />
<br />
Auxiliadas pela experi&ecirc;ncia de duas l&iacute;deres do Quadrante M&aacute;gico do Gartner, as organiza&ccedil;&otilde;es de TI podem obter ajuda acess&iacute;vel para manter a receita fundamental, produzindo aplica&ccedil;&otilde;es on-line e atuando com desempenho m&aacute;ximo.</p>

<h3>Endnotes</h3>

<p><sup>1</sup> http://www.business2community.com/tech-gadgets/the-future-of-enterprise-it-30-executives-share-their-2013-predictions-0365559#ogMQ2uUKTzscK0j4.99<br />
<sup>2</sup> Ronni J. Colville and George Spafford, &ldquo;Configuration Management for Virtual and Cloud Infrastructures,&rdquo; Gartner, http://www.rbiassets.com/getfile.ashx/42112626510<br />
<sup>3</sup> Ted Chamberlin and Lydia Leong, &ldquo;Magic Quadrant for Managed Hosting,&rdquo; Gartner, March 5, 2012, http://www.gartner.com/technology/reprints.do?id=1-19K9FPH&amp;ct=120305&amp;st=sb</p>
tures,&rdquo; Gartner, http://www.rbiassets.com/getfile.ashx/42112626510<br />
<sup>3</sup> Ted Chamberlin and Lydia Leong, &ldquo;Magic Quadrant for Managed Hosting,&rdquo; Gartner, March 5, 2012, http://www.gartner.com/technology/reprints.do?id=1-19K9FPH&amp;ct=120305&amp;st=sb</p>
