---
node_id: 3540
title: Building Your Ecommerce Strategy
type: whitepaper
created_date: '2013-06-19'
created_by: Liz Staplefoote
last_modified_date: '2016-01-08'
last_modified_by: Kelly Holcomb
product: White Paper
product_url: white-paper
resource: 'https://8026b2e3760e2433679c-fffceaebb8c6ee053c935e8915a3fbe7.ssl.cf2.rackcdn.com/whitepaper_pdf/Building_Ecommerce_Strategy_2015.pdf'
---

<p>Com&eacute;rcio eletr&ocirc;nico refere-se &agrave; soma de todas as intera&ccedil;&otilde;es que um cliente tem com seus neg&oacute;cios no site, dispositivo m&oacute;vel e outras experi&ecirc;ncias digitais. Quanto mais um cliente compra em seu site, mais prov&aacute;vel &eacute; que ele o indique aos seus amigos e fam&iacute;lia. A experi&ecirc;ncia de marca que voc&ecirc; cria on-line &eacute; integral para trazer os compradores de volta e divulgar a sua reputa&ccedil;&atilde;o boca a boca e atrair novos clientes.</p>

<p>Come&ccedil;ar com uma estrat&eacute;gia de com&eacute;rcio eletr&ocirc;nico b&aacute;sico ajuda a identificar e planejar as lacunas, responde pela conformidade e apoia a satisfa&ccedil;&atilde;o do cliente considerando todas as partes m&oacute;veis da sua loja. Sem uma estrat&eacute;gia, voc&ecirc; poder&aacute; enfrentar:</p>

<ul>
	<li>Layouts confusos que resultam no aumento das taxas de rejei&ccedil;&atilde;o</li>
	<li>Problemas de seguran&ccedil;a que causam a perda de confian&ccedil;a e m&aacute; publicidade</li>
	<li>Falta de conformidade, resultando em pesadas multas ou na incapacidade de receber os pagamentos</li>
	<li>Mal planejamento de recursos que pode levar &agrave; desativa&ccedil;&atilde;o das vendas</li>
</ul>

<p>O resultado desejado do cliente deve dirigir o foco do neg&oacute;cio, as tecnologias utilizadas e as medidas de seguran&ccedil;a implementadas para criar confian&ccedil;a, fidelidade, neg&oacute;cios recorrentes e refer&ecirc;ncias.</p>

<p><em>O atraso de 1 segundo na resposta pode levar a uma queda de 7% nas convers&otilde;es<sup>1</sup>.</em></p>

<h3><strong>Elementos da estrat&eacute;gia do com&eacute;rcio eletr&ocirc;nico</strong></h3>

<p>O caminho que um comerciante toma para construir sua experi&ecirc;ncia ideal do cliente &eacute; exclusivo do seu setor, vis&atilde;o de marca e objetivos, mas deve incluir esses elementos:</p>

<ul>
	<li>Estrat&eacute;gia baseada no usu&aacute;rio para os caminhos da est&eacute;tica e compra</li>
	<li>Sele&ccedil;&atilde;o da plataforma, incluindo um plano para replataforma&ccedil;&atilde;o, se for o caso</li>
	<li>Funcionalidade de dispositivo m&oacute;vel adequada ao mercado e exclusiva a partir do seu site de desktop</li>
	<li>Medidas de seguran&ccedil;a e conformidade conforme ditadas pelo seu setor</li>
	<li>Prepara&ccedil;&atilde;o para o pico de tr&aacute;fego incluindo testes de carga e refer&ecirc;ncia do desempenho</li>
</ul>

<p>No presente artigo, vamos cobrir o b&aacute;sico de cada elemento como um ponto de partida para a constru&ccedil;&atilde;o e execu&ccedil;&atilde;o da &oacute;tima experi&ecirc;ncia do seu cliente.</p>

<h3><strong>Foco baseado no usu&aacute;rio</strong></h3>

<p>Pense como um cliente. Isso come&ccedil;a considerando o olhar, a sensa&ccedil;&atilde;o e o fluxo de sua presen&ccedil;a on-line e se estende atrav&eacute;s dos seus esfor&ccedil;os nas m&iacute;dias sociais e em outras atividades on-line. Sua p&aacute;gina inicial deve dizer "Ol&aacute;" como um balconista faria em uma loja f&iacute;sica e levar o usu&aacute;rio atrav&eacute;s de seu site com instru&ccedil;&otilde;es relevantes, coloca&ccedil;&atilde;o de informa&ccedil;&otilde;es, imagens, consist&ecirc;ncia de design, navega&ccedil;&atilde;o l&oacute;gica e um ambiente seguro.</p>

<p>Use p&aacute;ginas din&acirc;micas para oferecer conte&uacute;do personalizado com base no perfil do usu&aacute;rio. Por exemplo, um varejista de artigos esportivos pode exibir uma p&aacute;gina inicial que destaca equipamentos de camping. Um usu&aacute;rio anterior que havia navegado por barracas pode ver esta p&aacute;gina inicial, enquanto um usu&aacute;rio que navegou por jet skis pode receber um conte&uacute;do totalmente diferente. Recursos de pesquisa aprimorados d&atilde;o aos usu&aacute;rios uma maneira r&aacute;pida de encontrar exatamente o que est&atilde;o procurando quando n&atilde;o querem navegar no site. A adi&ccedil;&atilde;o de conte&uacute;do que apoia o processo de compra, como coment&aacute;rios, v&aacute;rias visualiza&ccedil;&otilde;es de produtos e bate-papo ajuda na ado&ccedil;&atilde;o de experi&ecirc;ncias que transformam os navegadores do site em clientes fi&eacute;is.</p>

<p>Para determinar quais caracter&iacute;sticas s&atilde;o adequadas para o seu produto e clientes, use a an&aacute;lise e pesquisas de clientes. Isso vai ajudar a descobrir o que est&aacute; funcionando ou faltando. Executar as mais avan&ccedil;adas caracter&iacute;sticas significam mais do que apenas mudar o texto e as imagens. Em vez disso, voc&ecirc; pode precisar repensar ou renovar os atuais esquemas e formas do banco de dados para dimensionar os sistemas para dar conta da coleta, armazenamento e manipula&ccedil;&atilde;o de novos tipos de dados.</p>

<p><em>Consulte </em><a href="/how-to/the-ecommerce-customer-experience-0"><em>O Guia de Experi&ecirc;ncia do Cliente de Com&eacute;rcio Eletr&ocirc;nico</em></a><em> para ajudar a criar sua estrat&eacute;gia de experi&ecirc;ncia do cliente.</em></p>

<h3><strong>Escolhendo sua plataforma de loja de com&eacute;rcio eletr&ocirc;nico</strong></h3>

<p>A sua plataforma de com&eacute;rcio eletr&ocirc;nico consiste do software, como o <a href="http://www.rackspace.com/pt/ecommerce-hosting/magento/">Magento</a>, <a href="http://www.rackspace.com/pt/ecommerce-hosting/oracle-retail/">Oracle Commerce</a>, <a href="http://www.rackspace.com/pt/wcm/aem/">Adobe</a> ou outros, com a infraestrutura selecionada para executar o software.</p>

<p>A decis&atilde;o de software deve se basear nos objetivos da experi&ecirc;ncia do seu cliente. Se o seu site tiver a op&ccedil;&atilde;o de configurar individualmente os seus produtos, mas o seu software de com&eacute;rcio eletr&ocirc;nico n&atilde;o tiver suporte para isso, voc&ecirc; n&atilde;o poder&aacute; oferecer a experi&ecirc;ncia planejada. Da mesma forma, executar uma plataforma de com&eacute;rcio eletr&ocirc;nico pesada de recursos em hardware de baixo desempenho, produz uma proposta perdedora, j&aacute; que os clientes rejeitam o site devido ao lento carregamento das p&aacute;ginas. Suas op&ccedil;&otilde;es para infraestrutura de com&eacute;rcio eletr&ocirc;nico incluem:</p>

<ul>
	<li><strong>Nuvem:</strong> aproveita a infraestrutura altamente expans&iacute;vel e ambientes pr&eacute;-configurados ou altamente personaliz&aacute;veis para reduzir as cargas de hardware e de gerenciamento. Escolha uma <a href="http://www.rackspace.com/pt/cloud/public">nuvem p&uacute;blica</a> de baixo custo ou uma <a href="http://www.rackspace.com/pt/cloud/private/">nuvem privada</a> para cargas de trabalho sujeitas a regula&ccedil;&otilde;es rigorosas de seguran&ccedil;a ou de conformidade.</li>
	<li><strong>Ambiente local:</strong> passa a carga de hardware, seguran&ccedil;a, desempenho e escalabilidade para a equipe e o or&ccedil;amento de TI. Isso lhe proporciona um controle total sobre todas as dores de cabe&ccedil;a que acompanham a responsabilidade por toda a infraestrutura de com&eacute;rcio eletr&ocirc;nico.</li>
	<li><a href="http://www.rackspace.com/pt/cloud/hybrid/"><strong>Nuvem h&iacute;brida</strong></a><strong>:</strong> combina <a href="http://www.rackspace.com/pt/managed_hosting/dedicated_servers/">hardware dedicado</a> ou local com recursos de nuvem para atingir efici&ecirc;ncias de nuvem e atender a determinadas necessidades de seguran&ccedil;a ou de conformidade. Em um ambiente de nuvem h&iacute;brida, um varejista pode transferir determinadas cargas de trabalho, como <a href="http://www.rackspace.com/pt/email-hosting/">e-mail </a>ou <a href="http://www.rackspace.com/pt/cloud/files/technology/?page=cdn">fornecimento de conte&uacute;do</a>, para a nuvem, mantendo o controle sobre outros sistemas cr&iacute;ticos que s&atilde;o mais bem executados em equipamento dedicado ou no local.</li>
</ul>

<p><em>Leia </em><a href="/how-to/ecommerce-re-platforming-basics"><em>Princ&iacute;pios b&aacute;sicos de replataforma&ccedil;&atilde;o de com&eacute;rcio eletr&ocirc;nico</em></a><em> para mais orienta&ccedil;&otilde;es sobre planejamento e execu&ccedil;&atilde;o de um projeto de replataforma&ccedil;&atilde;o.</em></p>

<h3><strong>Funcionalidade de dispositivos m&oacute;veis </strong></h3>

<p>A experi&ecirc;ncia m&oacute;vel aproveita funcionalidades m&oacute;veis espec&iacute;ficas, como "clique para ligar", integra&ccedil;&atilde;o GPS para mapas ou direcionamento geogr&aacute;fico, reconhecimento de gestos e outras. Imagine que voc&ecirc; precisa direcionar geograficamente clientes em uma &aacute;rea central com servidores lentos que s&oacute; entregam a notifica&ccedil;&atilde;o horas mais tarde.</p>

<p><em>O com&eacute;rcio eletr&ocirc;nico m&oacute;vel (com&eacute;rcio m&oacute;vel) &eacute; respons&aacute;vel por 1 em cada 10 d&oacute;lares de com&eacute;rcio eletr&ocirc;nico e dever&aacute; crescer a US$ 86 bilh&otilde;es at&eacute; 2016<sup>2</sup>.</em></p>

<p>O dispositivo m&oacute;vel tamb&eacute;m vem com um novo conjunto de regras de usabilidade. A profundidade do conte&uacute;do do seu site tem que encolher para telas menores, enquanto elementos como bot&otilde;es e imagens precisam de mais espa&ccedil;o na tela para acomodar o toque no dispositivo. A coloca&ccedil;&atilde;o de plug-ins sociais e a opera&ccedil;&atilde;o de carrinho de compras tamb&eacute;m precisam ser simplificadas para ajudar e n&atilde;o prejudicar a compra.</p>

<p>Ao longo dos anos, as empresas abordam plataformas m&oacute;veis e de desktop com estrat&eacute;gias distintas. Isso muitas vezes resulta em uma vers&atilde;o otimizada para dispositivo m&oacute;vel de um site e/ou um app para dispositivo m&oacute;vel nativo acompanhante. No entanto, manter um desktop e app para dispositivo m&oacute;vel isolados leva muitas vezes &agrave; insatisfa&ccedil;&atilde;o do usu&aacute;rio e a experi&ecirc;ncias desconectadas quando o app para dispositivo m&oacute;vel mais recente n&atilde;o flui ou n&atilde;o &eacute; operado da mesma forma que o site de desktop tradicional. Um projeto &aacute;gil permite que as operadoras de com&eacute;rcio eletr&ocirc;nico projetem um &uacute;nico site que se apresente de forma diferente em diferentes dispositivos, uma abordagem que economiza recursos, reutilizando imagens e conte&uacute;do. Isso permite uma experi&ecirc;ncia visual e de conte&uacute;do consistente em dispositivos desktop, celulares e tablets.</p>

<p><em>Saiba mais sobre o <a href="http://www.rackspace.com/blog/develop-mobile-apps-quickly-on-the-rackspace-cloud/">uso de pilhas de dispositivos m&oacute;veis pr&eacute;-configuradas</a> para apoiar sua experi&ecirc;ncia m&oacute;vel. </em></p>

<h3><strong>Prepara&ccedil;&atilde;o para o pico de tr&aacute;fego</strong></h3>

<p>Quase metade das empresas (48%) relatam que o tempo de inatividade impacta negativamente sua marca e reputa&ccedil;&atilde;o<sup>3</sup>. A incapacidade de manter as opera&ccedil;&otilde;es durante uma falha ou um pico &eacute; um risco enorme para um site de com&eacute;rcio eletr&ocirc;nico. Se o seu ambiente encontrar um problema com um patch, uma atualiza&ccedil;&atilde;o de c&oacute;digo, uma falha de componente de servi&ccedil;o ou hardware ou desastre natural, o que acontecer&aacute; com o seu site? Voc&ecirc; tem um plano de conting&ecirc;ncia para problemas previstos <em>e</em> imprevistos de tempo de inatividade? Documentar a sua estrat&eacute;gia de com&eacute;rcio eletr&ocirc;nico permite identificar as necessidades de identidade e infraestrutura que podem impactar negativamente o desempenho.</p>

<p>Os testes de estresse, o equivalente &agrave; execu&ccedil;&atilde;o de um "treinamento de inc&ecirc;ndio" em seu site, s&atilde;o essenciais para entender as opera&ccedil;&otilde;es do site e onde s&atilde;o necess&aacute;rias otimiza&ccedil;&otilde;es. Cada sistema tem limites f&iacute;sicos e a maioria dos ambientes de com&eacute;rcio eletr&ocirc;nico s&atilde;o &uacute;nicos. Sob estresse, um site pode revelar uma fraqueza ou uma ruptura na opera&ccedil;&atilde;o, permitindo que voc&ecirc; ajuste o seu site para mitigar o risco antes do feedback do cliente irritado ou da rea&ccedil;&atilde;o da m&iacute;dia social.</p>

<p>Crie testes de desempenho anuais ou trimestrais, de prefer&ecirc;ncia em per&iacute;odos de baixa, para que os sistemas principais n&atilde;o sejam impactados. Os testes devem avaliar o desempenho em todo ambiente de com&eacute;rcio eletr&ocirc;nico: da transfer&ecirc;ncia de rede &agrave; entrada e sa&iacute;da do disco, velocidade de failover e at&eacute; mesmo a utiliza&ccedil;&atilde;o da mem&oacute;ria ou CPU, uma vez que um elo fraco pode prejudicar todo o ambiente.</p>

<p><em>N&atilde;o tem certeza quanto custa o tempo de inatividade? Assista ao v&iacute;deo </em><a href="https://www.youtube.com/watch?v=ASDViz2iSz8&amp;feature=youtu.be"><em>Seja Resiliente e Esteja Preparado</em></a><em> para orienta&ccedil;&otilde;es sobre o c&aacute;lculo de custos do tempo de inatividade e planejamento de recupera&ccedil;&atilde;o de desastres.</em></p>

<h3><strong>Medidas de conformidade e seguran&ccedil;a</strong></h3>

<p>As transa&ccedil;&otilde;es de com&eacute;rcio eletr&ocirc;nico constroem a confian&ccedil;a dos consumidores, limitando o risco de atividades fraudulentas e assegurando a privacidade das informa&ccedil;&otilde;es do consumidor. No entanto, em nove anos, o relat&oacute;rio de Investiga&ccedil;&otilde;es de Viola&ccedil;&atilde;o de Dados Verizon registrou mais de 1,2 bilh&atilde;o de ocorr&ecirc;ncias, com 24% das viola&ccedil;&otilde;es atribu&iacute;das ao varejo<sup>4</sup>. Esses registros incluem n&uacute;meros de cart&atilde;o de cr&eacute;dito, informa&ccedil;&otilde;es de identifica&ccedil;&atilde;o pessoal, dados do titular do cart&atilde;o que foi perdido, roubado ou acessado sem autoriza&ccedil;&atilde;o.</p>

<p>Para minimizar este risco, o setor de cart&otilde;es de pagamento (PCI) criou uma comiss&atilde;o, o <a href="https://www.pcisecuritystandards.org/security_standards/role_of_pci_council.php">Conselho de padr&otilde;es de seguran&ccedil;a de dados do setor de cart&otilde;es de pagamento (PCI SSC)</a>, encarregada de especificar e manter os padr&otilde;es de seguran&ccedil;a de dados do setor de cart&otilde;es de pagamento (PCI DSS). Os PCI DSS ajudam a aliviar as vulnerabilidades associadas com a transmiss&atilde;o, armazenamento e/ou processamento de dados do titular do cart&atilde;o, especificamente o n&uacute;mero da conta principal.</p>

<p><em>6% das empresas em 2012 que estiveram sujeitas aos PCI DSS e sofreram uma viola&ccedil;&atilde;o n&atilde;o estavam em conformidade<sup>5</sup></em>.</p>

<p>Alcan&ccedil;ar a conformidade com os PCI DSS &eacute; um processo cont&iacute;nuo de avalia&ccedil;&atilde;o de desempenho, esfor&ccedil;os de corre&ccedil;&atilde;o e relat&oacute;rios de resultados. O Conselho mant&eacute;m uma <a href="https://www.pcisecuritystandards.org/security_standards/documents.php">biblioteca de documenta&ccedil;&atilde;o</a> para ajudar os comerciantes e prestadores de servi&ccedil;os a mitigar o risco e manter as transa&ccedil;&otilde;es on-line seguras.</p>

<p>As empresas que usam transa&ccedil;&otilde;es on-line devem primeiro identificar riscos potenciais de identidade para o consumidor e para a pr&oacute;pria empresa. Se os recursos existentes n&atilde;o puderem executar de forma confi&aacute;vel e suficientemente essas fun&ccedil;&otilde;es, pense numa solu&ccedil;&atilde;o mais adequada ao seu modelo de neg&oacute;cio e que proteja todas as partes envolvidas segundo os PCI DSS. Os sites de com&eacute;rcio eletr&ocirc;nico tem tr&ecirc;s maneiras de atender aos requisitos dos PCI DSS:</p>

<ul>
	<li>Use um gateway de pagamento que envolva a integra&ccedil;&atilde;o com uma Application Program Interface (API) para facilitar a transmiss&atilde;o do n&uacute;mero da conta principal com ou sem o armazenamento desta informa&ccedil;&atilde;o</li>
	<li>Transmita e armazene internamente o n&uacute;mero da conta principal</li>
	<li>Opte por terceirizar a transmiss&atilde;o, armazenamento e/ou processamento dos dados de pagamento</li>
</ul>

<p>Em &uacute;ltima an&aacute;lise, o percurso que uma organiza&ccedil;&atilde;o toma para cumprir os requisitos dos PCI DSS &eacute; uma decis&atilde;o de neg&oacute;cio e deve ser avaliada com cuidado.</p>

<p><strong>Seguran&ccedil;a geral do site</strong></p>

<p>Os PCI DSS abrangem as melhores pr&aacute;ticas para a prote&ccedil;&atilde;o de informa&ccedil;&otilde;es confidenciais do portador do cart&atilde;o. H&aacute; poucas orienta&ccedil;&otilde;es sobre como proteger os elementos do com&eacute;rcio eletr&ocirc;nico fora da conformidade com o PCI. Os ataques de DDoS e v&iacute;rus transmitidos por e-mail ainda podem acabar com as opera&ccedil;&otilde;es de um site compat&iacute;vel.</p>

<p>Os sistemas (servidores, armazenamento, software, etc.) que suportam transa&ccedil;&otilde;es de com&eacute;rcio eletr&ocirc;nico podem ser caros para proteger e gerenciar. &Eacute; nestes tipos de cargas de trabalho onde as <a href="http://www.rackspace.com/pt/cloud/hybrid/">solu&ccedil;&otilde;es de nuvem h&iacute;brida</a> est&atilde;o ganhando ado&ccedil;&atilde;o. Com uma abordagem de nuvem h&iacute;brida, os comerciantes podem tirar proveito das efici&ecirc;ncias de nuvens, mantendo sistemas compat&iacute;veis para transmitir, processar e/ou armazenar informa&ccedil;&otilde;es do titular do cart&atilde;o em equipamento dedicado ou no local.</p>

<p><em>Saiba como integrar a nuvem em seus esfor&ccedil;os de conformidade para PCI em </em><a href="/how-to/pci-compliance-in-rackspace-hybrid-cloud"><em>Conformidade com o PCI em nuvem h&iacute;brida</em></a></p>

<h3><strong>Introdu&ccedil;&atilde;o</strong></h3>

<p><strong>Mapeando o fluxo e processos do site</strong></p>

<p>O fluxo do site &eacute; geralmente mapeado usando-se fluxogramas ou software que permitam a voc&ecirc; delinear visualmente os caminhos de compra. A seguinte lista representa os elementos b&aacute;sicos do fluxo do site categorizados em atividades voltadas ao neg&oacute;cio, t&eacute;cnica e cliente. Seu site pode ter mais ou menos elementos com base em seus objetivos de experi&ecirc;ncia:</p>

<p>Neg&oacute;cio:</p>

<ul>
	<li>Campanha de marketing, promo&ccedil;&atilde;o de vendas ou men&ccedil;&atilde;o de m&iacute;dia direciona clientes para o site</li>
	<li>A atividade de m&iacute;dia social estimula o tr&aacute;fego</li>
	<li>Internos/funcion&aacute;rios acessam o site para consultas</li>
</ul>

<p>Cliente:</p>

<ul>
	<li>Os usu&aacute;rios acessam o site usando um navegador da internet e seu desktop, celular ou tablet</li>
	<li>Solicitam viagens na internet (servidores de nome de cache/servidores e nome raiz)</li>
</ul>

<p>T&eacute;cnica:</p>

<ul>
	<li>URL registrada configurada para resolver para um endere&ccedil;o IP p&uacute;blico atrav&eacute;s de DNS e IP resolvido para um provedor de servi&ccedil;os de internet (ISP)</li>
	<li>Pedido de endere&ccedil;o IP enviado por meio de uma s&eacute;rie de roteadores para o seu centro de dados</li>
	<li>O endere&ccedil;o IP e n&uacute;mero de porta (80-http/443-https) viajam por uma s&eacute;rie de switches</li>
	<li>O servidor de servi&ccedil;o web aceita o pedido e responde com conte&uacute;do ou envia um pedido para um servidor de banco de dados</li>
	<li>A informa&ccedil;&atilde;o viaja de volta ao cliente para cada pedido</li>
</ul>

<p>Cliente:</p>

<ul>
	<li>V&ecirc; os dados solicitados</li>
	<li>Toma a decis&atilde;o de continuar navegando no site</li>
	<li>Adiciona um item &agrave; aplica&ccedil;&atilde;o web/carrinho de compras</li>
	<li>Passa para o processo de conclus&atilde;o</li>
</ul>

<p>T&eacute;cnica:</p>

<ul>
	<li>O processo de conclus&atilde;o de compra e/ou registro no site deve estar de acordo com os regulamentos de privacidade</li>
	<li>Os gateways de pagamento devem atender as orienta&ccedil;&otilde;es de conformidade</li>
	<li>Confirma o m&eacute;todo de pagamento utilizado</li>
</ul>

<p>Neg&oacute;cio:</p>

<ul>
	<li>Gera a confirma&ccedil;&atilde;o da compra</li>
	<li>Comunica&ccedil;&atilde;o transacional e acompanhamento do pedido</li>
	<li>Invent&aacute;rio e coordena&ccedil;&atilde;o da execu&ccedil;&atilde;o</li>
</ul>

<p><strong>O invent&aacute;rio</strong></p>

<p>Ap&oacute;s mapear o fluxo do site, a cria&ccedil;&atilde;o do invent&aacute;rio ajuda a definir os componentes individuais que voc&ecirc; j&aacute; tem ou que precisa ter, a fim de executar o fluxo do site e processos como planejados. Um invent&aacute;rio bem desenvolvido orienta a estrat&eacute;gia que proporciona uma experi&ecirc;ncia de usu&aacute;rio superior. Ele tamb&eacute;m pode descobrir as &aacute;reas de melhoria e as &aacute;reas que ningu&eacute;m lembra delas at&eacute; que algo d&ecirc; errado, como a funcionalidade da seguran&ccedil;a ou do carrinho de compras. O invent&aacute;rio de um site de com&eacute;rcio eletr&ocirc;nico pode incluir:<br />
<img alt="" height="236" src="https://8026b2e3760e2433679c-fffceaebb8c6ee053c935e8915a3fbe7.ssl.cf2.rackcdn.com/RackspaceEcommerce-BuildingSoundEcommerceStrategy-2.png" width="273" />Esses itens dividem-se entre departamentos. Todos os interessados &ZeroWidthSpace;&ZeroWidthSpace;devem apontar os aspectos de seu foco particular que n&atilde;o s&atilde;o representados. Por exemplo, examinar o invent&aacute;rio a partir de uma perspectiva de neg&oacute;cios pode apontar que o marketing n&atilde;o est&aacute; na lista, e sem o marketing n&atilde;o haveria clientes visitando o site. A perspectiva t&eacute;cnica vai descobrir as defici&ecirc;ncias de hardware ou centro de dados. A perspectiva de seguran&ccedil;a pode avaliar os firewalls, certificados SSL ou os mais de 200 outros requisitos que devem ser considerados para um site de com&eacute;rcio eletr&ocirc;nico.</p>

<p>Criar um invent&aacute;rio verificado &eacute; desgastante, no entanto, &eacute; o primeiro passo importante para entender como todas as pe&ccedil;as do seu site funcionam em conjunto. Depois de ter conclu&iacute;do este invent&aacute;rio, voc&ecirc; ter&aacute; melhor compreens&atilde;o do que voc&ecirc; precisa fazer para implementar as tecnologias e processos necess&aacute;rios para o suporte do seu site.</p>

<h3><strong>Resumo</strong></h3>

<p>De acordo com o estudo da 2014 Forrester and Shop.org, "O Estado do Varejo On-line", os clientes repetidos representam 51% das receitas do site. Isso significa que quatro em cada dez de seus concorrentes est&atilde;o planejando uma revis&atilde;o de site este ano <sup>6</sup> e que talvez seja hora de voc&ecirc; verificar ou atualizar sua estrat&eacute;gia de com&eacute;rcio eletr&ocirc;nico para n&atilde;o ser deixado para tr&aacute;s.</p>

<p><strong>Precisa de ajuda?</strong></p>

<p>Com profunda experi&ecirc;ncia e expertise nas principais plataformas digitais, a <a href="http://go.rackspace.com/digital">Rackspace Digital</a> pode fornecer orienta&ccedil;&otilde;es sobre as melhores pr&aacute;ticas, arquitetura, bem como suporte proativo nas seguintes compet&ecirc;ncias:</p>

<ul>
	<li><a href="http://go.rackspace.com/digital#content-target">Conte&uacute;do</a> - fornece expertise de hospedagem de infraestrutura e aplica&ccedil;&atilde;o para liderar as plataformas WCMS na capacita&ccedil;&atilde;o dos usu&aacute;rios para entregar experi&ecirc;ncias on-line consistentes, &aacute;geis e confi&aacute;veis para os clientes. Isso inclui Wordpress, Drupal, Sitecore, Adobe e Ektron.</li>
	<li><a href="http://go.rackspace.com/digital#commerce-target">Com&eacute;rcio</a> - utilizando infraestrutura aberta e h&iacute;brida e servi&ccedil;os para a constru&ccedil;&atilde;o de lojas on-line seguras, expans&iacute;veis &ZeroWidthSpace;&ZeroWidthSpace;e altamente dispon&iacute;veis para receitas on-line ampliadas e melhoradas via Magento Commerce Oracle, hybris e Intershop.</li>
	<li><a href="http://go.rackspace.com/digital#mobile-target">Dispositivo m&oacute;vel</a> - fornece infraestrutura m&oacute;vel flex&iacute;vel e expertise em hospedagem de plataforma de aplica&ccedil;&atilde;o em Node.js, FeedHenry e MutualMobile para capacitar os usu&aacute;rios a desenvolver servi&ccedil;os m&oacute;veis confi&aacute;veis e &ZeroWidthSpace;&ZeroWidthSpace;altamente expans&iacute;veis &ZeroWidthSpace;&ZeroWidthSpace;para os clientes.</li>
</ul>

<h3><strong>Clientes reais falam sobre os benef&iacute;cios reais empregando a Rackspace Digital em sua estrat&eacute;gia de com&eacute;rcio eletr&ocirc;nico:</strong></h3>

<p><strong>Conformidade</strong></p>

<p><img alt="" height="176" src="http://868bf64adfaa6ff1e57d-b126b1c47b6122d211dd9552bba6e6dd.r25.cf3.rackcdn.com/tfl.png" width="235" />&ldquo;Eu poderia dizer que, sem a consider&aacute;vel ajuda da Rackspace, n&oacute;s n&atilde;o ter&iacute;amos passado na rigoros&iacute;ssima auditoria do PCI. A Rackspace certamente foi al&eacute;m de suas atribui&ccedil;&otilde;es para garantir que tudo ficasse perfeito para n&oacute;s."<br />
Aingaran Somaskandarajah<br />
L&iacute;der t&eacute;cnico da Oyster Card</p>

<p><strong>Availability</strong></p>

<p><img alt="" height="106" src="http://www.rackspace.com/knowledge_center/sites/default/files/spencer.png" width="251" />"Nosso tr&aacute;fico e neg&oacute;cios podem aumentar de 100 a 1.000 vezes de seu tamanho no per&iacute;odo de entressafra. Temos de expandir e diminuir, mas tamb&eacute;m temos de tentar n&atilde;o dispor de muita infraestrutura no per&iacute;odo de entressafra. &Eacute; por isso que escolhemos a nuvem h&iacute;brida Rackspace baseada em <a href="http://www.rackspace.com/pt/cloud/hybrid/rackconnect/">RackConnect<sup>tm</sup></a> - dividimos nossa aplica&ccedil;&atilde;o entre uma infraestrutura dedicada privada para o nosso processo de compra e usamos a nuvem p&uacute;blica para descri&ccedil;&otilde;es de produtos, pre&ccedil;os e outras informa&ccedil;&otilde;es".<br />
Steve Vitale<br />
diretor de com&eacute;rcio eletr&ocirc;nico da Spencer Gifts</p>

<p><strong>Performance</strong></p>

<p><img alt="" height="122" src="http://www.rackspace.com/knowledge_center/sites/default/files/karmaloop.png" width="243" />"Com a Rackspace, a Karmaloop pode implantar uma variedade de servidores de ponta sempre que necess&aacute;rio e expandir esses servidores rapidamente, o que permite que fundamentalmente a empresa mantenha o grande desempenho do usu&aacute;rio, o tempo de carregamento da p&aacute;gina muito r&aacute;pido e ofere&ccedil;a aos clientes da Karmaloop um tempo de funcionamento de 100%".<br />
Gary Rush<br />
diretor de tecnologia da Karmaloop</p>

<p><strong>Mobile</strong></p>

<p><img alt="" height="120" src="http://www.rackspace.com/knowledge_center/sites/default/files/acquitygroup.png" width="251" />"A confiabilidade da Rackspace d&aacute; ao Acquity Group a liberdade de se concentrar na cria&ccedil;&atilde;o de &oacute;timos apps e admitir clientes sem se preocupar com a infraestrutura".<br />
Kevin Ellenwood<br />
vice-presidente de Servi&ccedil;os Compartilhados, Acquity Group Part of Accenture Interactive</p>

<p><strong>Cost Effectiveness</strong></p>

<p><img alt="" height="199" src="http://www.rackspace.com/knowledge_center/sites/default/files/dominos.png" width="231" />"A nuvem nos proporciona flexibilidade e redu&ccedil;&atilde;o de custos e n&atilde;o posso ver porque n&atilde;o podemos mover at&eacute; 80% de nossas cargas de trabalho globais para a nuvem, incluindo apps cr&iacute;ticos para os neg&oacute;cios e cargas de trabalho m&oacute;veis",<br />
Colin Rees<br />
diretor de TI da Domino's Pizza</p>

<div>
<hr align="left" size="1" width="33%" />
<div>
<p><sup>1</sup> <a href="http://www.strangeloopnetworks.com/resources/infographics/web-performance-and-user-expectations/%20poster-visualizing-web-performance%20/">http://www.strangeloopnetworks.com/resources/infographics/web-performance-and-user-expectations/ poster-visualizing-web-performance /</a></p>
</div>

<div>
<p><sup>2</sup> <a href="http://www.internetretailer.com/trends/sales/">http://www.internetretailer.com/trends/sales/</a></p>
</div>

<div>
<p><sup>3</sup> <a href="http://www.itbusinessedge.com/slideshows/show.aspx?c=90238&amp;slide=8">http://www.itbusinessedge.com/slideshows/show.aspx?c=90238&amp;slide=8</a></p>
</div>

<div>
<p><sup>4</sup> <a href="http://www.verizonenterprise.com/DBIR/2013/">http://www.verizonenterprise.com/DBIR/2013/</a></p>
</div>

<div>
<p><sup>5</sup> <a href="http://www.verizonenterprise.com/DBIR/2013/">http://www.verizonenterprise.com/DBIR/2013/</a></p>
</div>

<div>
<p><sup>6</sup> <a href="http://www.nrf.com/modules.php?name=News&amp;op=viewlive&amp;sp_id=1757">http://www.nrf.com/modules.php?name=News&amp;op=viewlive&amp;sp_id=1757</a></p>
</div>
</div>
div>

<div>
<p><sup>3</sup> <a href="http://www.itbusinessedge.com/slideshows/show.aspx?c=90238&amp;slide=8">http://www.itbusinessedge.com/slideshows/show.aspx?c=90238&amp;slide=8</a></p>
</div>

<div>
<p><sup>4</sup> <a href="http://www.verizonenterprise.com/DBIR/2013/">http://www.verizonenterprise.com/DBIR/2013/</a></p>
</div>

<div>
<p><sup>5</sup> <a href="http://www.verizonenterprise.com/DBIR/2013/">http://www.verizonenterprise.com/DBIR/2013/</a></p>
</div>

<div>
<p><sup>6</sup> <a href="http://www.nrf.com/modules.php?name=News&amp;op=viewlive&amp;sp_id=1757">http://www.nrf.com/modules.php?name=News&amp;op=viewlive&amp;sp_id=1757</a></p>
</div>
</div>
