---
node_id: 3843
title: Ecommerce Re-Platforming Basics
type: whitepaper
created_date: '2014-01-06'
created_by: Rackspace Support
last_modified_date: '2015-07-21'
last_modified_by: Max Francisco
product: White Paper
product_url: white-paper
resource: 'https://8026b2e3760e2433679c-fffceaebb8c6ee053c935e8915a3fbe7.ssl.cf2.rackcdn.com/whitepaper_pdf/Rackspace-Ecommerce-Replatform-Basics-1.pdf'
---

<p><img align="right" alt="" height="195" src="https://8026b2e3760e2433679c-fffceaebb8c6ee053c935e8915a3fbe7.ssl.cf2.rackcdn.com/Ecommreplatforming-2_0.png" width="194" /></p>

<p>Ao longo da &uacute;ltima d&eacute;cada, padr&otilde;es de compra e avan&ccedil;os tecnol&oacute;gicos alteraram radicalmente as metas das empresas e as realidades competitivas. Os consumidores exigem experi&ecirc;ncias de compra mais r&aacute;pidas e mais atraentes atrav&eacute;s de m&uacute;ltiplos canais na loja, &eacute; claro, mas tamb&eacute;m cada vez mais por meio de dispositivos m&oacute;veis e on-line. E o impacto de uma experi&ecirc;ncia negativa do cliente &eacute; significativo: uma pesquisa do Google revela que mais da metade (52%) dos consumidores tornam-se menos propensos a se envolver com um neg&oacute;cio depois de uma &uacute;nica experi&ecirc;ncia m&oacute;vel ruim<sup>1</sup>. Se um cliente tem que esperar mais de uma fra&ccedil;&atilde;o de segundo at&eacute; uma p&aacute;gina carregar, ou se o site n&atilde;o pode proporcionar uma rica experi&ecirc;ncia multicanal, esse cliente pode ser perdido para sempre. Muitos varejistas j&aacute; percebem que suas plataformas atuais n&atilde;o s&atilde;o mais adequadas &agrave;s necessidades dos clientes digitais mais exigentes, sem falar nas suas pr&oacute;prias.</p>

<p>Dado o escopo do projeto e as potenciais consequ&ecirc;ncias, a replataforma&ccedil;&atilde;o pode parecer assustadora. Este guia oferece informa&ccedil;&otilde;es valiosas sobre replataforma&ccedil;&atilde;o, inclusive como determinar se &eacute; hora de agir, quais os fatores que precisam ser considerados para garantir o sucesso e quais as arquiteturas comuns que atendem &agrave;s necessidades da maioria das empresas.</p>

<h3>COMO RECONHECER O MOMENTO OPORTUNO</h3>

<p>De acordo com uma pesquisa recente da Forrester Research, mais da metade dos executivos de com&eacute;rcio eletr&ocirc;nico (54%) afirmam que a replataforma&ccedil;&atilde;o &eacute; a sua prioridade nos pr&oacute;ximos 12 meses<sup>2</sup>. Isso n&atilde;o &eacute; surpresa, uma vez que outra pesquisa da Forrester<sup>3</sup> indica que 81% dos varejistas de com&eacute;rcio eletr&ocirc;nico est&aacute; usando uma solu&ccedil;&atilde;o local de cria&ccedil;&atilde;o pr&oacute;pria ou licenciada, ainda que 74% tema que suas solu&ccedil;&otilde;es existentes n&atilde;o acompanhem seus planos de crescimento. Quase metade (46%) dos varejistas relata dificuldade na contrata&ccedil;&atilde;o do pessoal necess&aacute;rio para gerir plataformas licenciadas ou ajustar continuamente plataformas de com&eacute;rcio eletr&ocirc;nico criadas internamente. Em &uacute;ltima an&aacute;lise, isso significa que as empresas est&atilde;o dispendendo tempo e esfor&ccedil;o significativos para acompanhar as exig&ecirc;ncias do mercado e administrar a infraestrutura subjacente.</p>

<p>A evolu&ccedil;&atilde;o do varejo tradicional em canais digitais destaca a necessidade de desempenho. A infraestrutura necess&aacute;ria para proporcionar a experi&ecirc;ncia digital est&aacute; se tornando cada vez mais complexa, com demandas para mais facilidade de utiliza&ccedil;&atilde;o, responsividade e agilidade. Isto est&aacute; ocorrendo num momento em que os recursos est&atilde;o espalhado por toda a organiza&ccedil;&atilde;o, devido a exig&ecirc;ncias como big data, necessidades de usu&aacute;rios internos e recupera&ccedil;&atilde;o de desastres. Tentar avan&ccedil;ar rumo &agrave; nova realidade digital com sistemas antigos resulta em desempenho lento e inefici&ecirc;ncia generalizada.</p>

<p>A maior parte das lojas de com&eacute;rcio eletr&ocirc;nico promove replataforma&ccedil;&otilde;es a cada dois ou tr&ecirc;s anos<sup>4</sup>. No entanto, o cronograma da replataforma&ccedil;&atilde;o varia com base em experi&ecirc;ncia &uacute;nica de cliente e objetivos de desempenho do varejista. Proceder &agrave; replataforma&ccedil;&atilde;o de uma opera&ccedil;&atilde;o de com&eacute;rcio eletr&ocirc;nico &eacute; um grande empreendimento, abrangendo os componentes da loja de com&eacute;rcio eletr&ocirc;nico:</p>

<ul>
	<li>Avaliar a plataforma de com&eacute;rcio eletr&ocirc;nico: a plataforma atual &eacute; capaz de suportar iniciativas futuras, ou est&aacute; prejudicando os planos existentes?</li>
	<li>Avaliar a solu&ccedil;&atilde;o de hospedagem: a organiza&ccedil;&atilde;o deve manter uma plataforma interna, passar tudo para um provedor de servi&ccedil;os ou empregar uma solu&ccedil;&atilde;o h&iacute;brida?</li>
</ul>

<p>Ambos os elementos s&atilde;o igualmente importantes para o sucesso da loja de com&eacute;rcio eletr&ocirc;nico. Colocar uma plataforma de com&eacute;rcio eletr&ocirc;nico de recursos pesados em uma infraestrutura abaixo do padr&atilde;o pode ser t&atilde;o desastroso quanto uma plataforma de com&eacute;rcio eletr&ocirc;nico restritiva em servidores de n&iacute;vel empresarial.</p>

<p><strong>5 PRINCIPAIS MOTIVOS CITADOS PARA A SUBSTITUI&Ccedil;&Atilde;O DA PLATAFORMA DE COM&Eacute;RCIO ELETR&Ocirc;NICO<sup>5</sup>:</strong></p>

<ul>
	<li>58%: melhorar a agilidade do neg&oacute;cio</li>
	<li>56%: reduzir os custos operacionais e de propriedade em geral</li>
	<li>51%: alinhar o custo de propriedade em rela&ccedil;&atilde;o &agrave;s receitas do com&eacute;rcio eletr&ocirc;nico</li>
	<li>51%: prestar suporte a iniciativas multicanal</li>
	<li>51%: acelerar a implementa&ccedil;&atilde;o de novas caracter&iacute;sticas e funcionalidades<br />
	&nbsp;</li>
</ul>

<h3>HORA DE ENTRAR EM A&Ccedil;&Atilde;O</h3>

<p>Em face da mudan&ccedil;a de comportamento dos compradores, os sites de com&eacute;rcio eletr&ocirc;nico existentes podem estar apresentando sinais de que seus dias de gl&oacute;ria ficaram para tr&aacute;s. Os sinais indicadores incluem:</p>

<ul>
	<li>Tempos de resposta inaceit&aacute;veis ou interrup&ccedil;&otilde;es frequentes</li>
	<li>Incapacidade de acompanhar a funcionalidade dos concorrentes</li>
	<li>Estrat&eacute;gias de vendas onicanal estagnadas pela deficiente integra&ccedil;&atilde;o entre os canais</li>
	<li>Dificuldade em cumprir com regula&ccedil;&otilde;es de conformidade do setor e do governo</li>
	<li>Melhorias de custo proibitivo necess&aacute;rias para corrigir falhas no sistema</li>
</ul>

<p>As organiza&ccedil;&otilde;es podem enfrentar novas exig&ecirc;ncias que n&atilde;o existiam ou que mudaram acentuadamente desde a cria&ccedil;&atilde;o da <a href="http://www.rackspace.com/pt/ecommerce-hosting/">plataforma de com&eacute;rcio eletr&ocirc;nico</a>. Na medida em que o cat&aacute;logo de produtos cresce, os requisitos de banco de dados podem mudar. Um aumento de usu&aacute;rios simult&acirc;neos influencia o tamanho e configura&ccedil;&atilde;o do servidor web. Operar em um ambiente global pode exigir a capacidade de <a href="http://www.rackspace.com/pt/cloud/files/technology/?page=cdn">localizar conte&uacute;dos</a>, apresentar e lidar com transa&ccedil;&otilde;es em moeda local do comprador e gerenciar os requisitos de conformidade locais.</p>

<p>Opera&ccedil;&otilde;es de com&eacute;rcio eletr&ocirc;nico que lidam com produtos f&iacute;sicos e digitais ou ofertas de software como servi&ccedil;o t&ecirc;m considera&ccedil;&otilde;es diferentes de um simples varejista de produtos on-line. Al&eacute;m disso, podem precisar de v&aacute;rios tipos de formas de pagamento, que variam de modelos e requisitos de uma &uacute;nica vez a modelos baseados em assinaturas. T&atilde;o importante quanto os m&eacute;todos de faturamento s&atilde;o os requisitos para lidar com renova&ccedil;&otilde;es, cart&otilde;es vencidos, reembolsos e quest&otilde;es de canal, como as comiss&otilde;es de marketing das filiais.</p>

<p>&Eacute; claro que todas as organiza&ccedil;&otilde;es que pensam na replataforma&ccedil;&atilde;o do com&eacute;rcio eletr&ocirc;nico devem levar em conta mudan&ccedil;as significativas nas tecnologias de m&iacute;dia m&oacute;vel e social ocorridas desde a implementa&ccedil;&atilde;o da plataforma anterior. At&eacute; 2017, segundo o eMarketer, cerca de 80% dos compradores digitais far&atilde;o compras em um dispositivo m&oacute;vel, com as vendas a partir de tablets representando quase 70% das compras<sup>6</sup>. Recentemente, as taxas de click-through de an&uacute;ncios do Facebook subiram 275%, enquanto o custo por clique caiu 40%, tornando a venda social outro imperativo vital a se considerar no processo de replataforma&ccedil;&atilde;o<sup>7</sup>.</p>

<p>Uma vez que a necessidade de replataforma&ccedil;&atilde;o for reconhecida, ser&aacute; fundamental estabelecer os objetivos do projeto. A fim de desenvolver esses objetivos, no entanto, a equipe deve criar uma estrat&eacute;gia adequada para as necessidades &uacute;nicas de neg&oacute;cio da empresa e considerar as demandas das v&aacute;rias partes interessadas. Os l&iacute;deres de neg&oacute;cios podem estar concentrados em quest&otilde;es como taxas de convers&atilde;o e reten&ccedil;&atilde;o de clientes, enquanto os tecn&oacute;logos podem se preocupar mais com seguran&ccedil;a, conformidade e desempenho. E tamb&eacute;m, &eacute; claro, h&aacute; o cliente, que deseja acesso r&aacute;pido a conte&uacute;do de qualidade e facilidade para concluir transa&ccedil;&otilde;es.</p>

<p>Um projeto bem sucedido equilibra essas metas. "Em &uacute;ltima an&aacute;lise, a quest&atilde;o de replataforma&ccedil;&atilde;o de um sistema de com&eacute;rcio eletr&ocirc;nico existente se resume a determinar os investimentos necess&aacute;rios para atingir as metas da organiza&ccedil;&atilde;o. A quest&atilde;o da economia de nuvem envolve mais do que a batida 'convers&atilde;o de CAPEX para OPEX'", explica <a href="http://www.rackspace.com/blog/author/mahesh-gandhe/">Mahesh Gandhe, gerente s&ecirc;nior de marketing de solu&ccedil;&otilde;es da Rackspace</a>.</p>

<p>Chris Vitale, diretor de com&eacute;rcio eletr&ocirc;nico da <a href="http://stories.rackspace.com/customers/pep-boys">Pep Boys</a>, descreve o estado futuro e tang&iacute;vel que a maioria dos varejistas procura, mas s&oacute; pode alcan&ccedil;ar por meio da replataforma&ccedil;&atilde;o de seus sistemas: "Teremos uma experi&ecirc;ncia multicanal em que algu&eacute;m interage conosco on-line, uma expectativa &eacute; definida e as pessoas continuam at&eacute; a loja, tendo uma experi&ecirc;ncia completa, quase tradicional, na loja com a gente".</p>

<h3>SELE&Ccedil;&Atilde;O DA PLATAFORMA DE COM&Eacute;RCIO ELETR&Ocirc;NICO</h3>

<p>A plataforma de com&eacute;rcio eletr&ocirc;nico consiste no software usado para gerenciar a apar&ecirc;ncia do seu site, invent&aacute;rio, processos de pagamento etc. A sele&ccedil;&atilde;o da plataforma &eacute; um fator decisivo da escolha de hospedagem, por isso h&aacute; muito o que considerar. A lista oferece uma base dos requisitos de plataforma, embora as quest&otilde;es adicionais &uacute;nicas para o neg&oacute;cio ser&atilde;o descobertas durante o processo de sele&ccedil;&atilde;o.</p>

<ul>
	<li><strong>MERCHANDISING DE PRODUTOS:</strong> Controlar a forma como os produtos e as informa&ccedil;&otilde;es s&atilde;o exibidos E como os descontos s&atilde;o mostrados ao cliente e processados &ZeroWidthSpace;&ZeroWidthSpace;em um sistema de pagamento; apresentar requisitos de personaliza&ccedil;&atilde;o de produtos; exibir conte&uacute;dos globais de produtos.</li>
	<li><strong>COMPATIBILIDADE DE DADOS:</strong> Analisar v&aacute;rios pontos de dados simultaneamente para um redirecionamento instant&acirc;neo para p&aacute;ginas din&acirc;micas ou para fornecer conte&uacute;do personalizado, permitindo que tipos de dados incompat&iacute;veis ou dados armazenados em silos "conversem" entre sim, sem prejudicar as iniciativas de experi&ecirc;ncia do cliente.</li>
	<li><strong>SISTEMA DE PAGAMENTO:</strong> Dar suporte a testes com recursos de ades&atilde;o ou cancelamento, compra de produtos f&iacute;sicos, gerenciamento de acesso a produtos SaaS, suporte para pagamentos globais e compatibilidade do carrinho de compras.</li>
	<li><strong>GERENCIAMENTO DE CANAL:</strong> Caracter&iacute;sticas que diferenciam os segmentos de clientes, fornecimento de conte&uacute;do din&acirc;mico com base no perfil do cliente, gest&atilde;o de lista de pre&ccedil;os para oferecer pre&ccedil;os alternativos para clientes selecionados e gest&atilde;o de conformidade global.</li>
	<li><strong>FUNCIONALIDADE DE DISPOSITIVOS M&Oacute;VEIS:</strong> Cria&ccedil;&atilde;o de interfaces de dispositivos m&oacute;veis de alto impacto em todos os smartphones e tablets, processamento em tempo real e otimiza&ccedil;&atilde;o de carrinho de compras de dispositivos m&oacute;veis.</li>
	<li><strong>MARKETING:</strong> Ferramentas para teste de contato com o cliente, capacidades de teste multivari&aacute;vel, marketing de aquisi&ccedil;&atilde;o/fideliza&ccedil;&atilde;o (campanhas de PPC, SEO, gerenciamento de lista de e-mail) e suporte a programas de afiliados.</li>
	<li><strong>CONTATOS COM CLIENTES:</strong> Capacidade de personalizar e enviar e-mails transacionais para a cria&ccedil;&atilde;o da conta, contatos relacionados com pedidos, conte&uacute;do localizado e novas vers&otilde;es do produto.</li>
	<li><strong>GERENCIAMENTO DE HOSPEDAGEM:</strong> Acesso a componentes de servidor dedicados e escal&aacute;veis, implanta&ccedil;&atilde;o de expans&atilde;o da nuvem para extens&atilde;o, cumprimento de conformidade com o PCI e cria&ccedil;&atilde;o de redund&acirc;ncia para recupera&ccedil;&atilde;o de desastres.</li>
</ul>

<h3>SELE&Ccedil;&Atilde;O DE HOSPEDAGEM</h3>

<p>Todas as empresas t&ecirc;m necessidades de neg&oacute;cios e de TI &uacute;nicas e existem diversas solu&ccedil;&otilde;es que podem ser adequadas. &Agrave;s vezes, a melhor configura&ccedil;&atilde;o para uma empresa inclui mais de uma op&ccedil;&atilde;o. Ao avaliar as op&ccedil;&otilde;es de hospedagem, &eacute; importante considerar se poss&iacute;veis quest&otilde;es de integra&ccedil;&atilde;o e implementa&ccedil;&atilde;o potenciais est&atilde;o alinhadas com os recursos e experi&ecirc;ncia de TI da organiza&ccedil;&atilde;o. H&aacute; uma enorme diferen&ccedil;a entre um provedor de nuvem comum que oferece apenas infraestrutura bruta &ndash; deixando que as empresas imaginem como implementar e conectar a plataforma de com&eacute;rcio eletr&ocirc;nico &ndash; e especialistas de hospedagem capazes de oferecer conhecimentos para cargas de trabalho &uacute;nicas. Escolher um parceiro de hospedagem com experi&ecirc;ncia especializada em plataformas e infraestrutura de com&eacute;rcio eletr&ocirc;nico ajuda a organiza&ccedil;&atilde;o a resolver as complexidades para arquitetar uma solu&ccedil;&atilde;o ideal.</p>

<p>As organiza&ccedil;&otilde;es devem rever as suas op&ccedil;&otilde;es em rela&ccedil;&atilde;o &agrave; pr&oacute;pria estrat&eacute;gia para escolher a combina&ccedil;&atilde;o certa. As op&ccedil;&otilde;es incluem:</p>

<ul>
	<li><strong>NUVEM:</strong> aproveita a infraestrutura altamente escal&aacute;vel e ambientes pr&eacute;-configurados ou altamente personaliz&aacute;veis para reduzir encargos de hardware e de gest&atilde;o. Escolha uma <a href="http://www.rackspace.com/pt/cloud/">nuvem p&uacute;blica</a> de baixo custo ou uma <a href="http://www.rackspace.com/pt/cloud/private/">nuvem privada</a> para cargas de trabalho sujeitas a regula&ccedil;&otilde;es rigorosas de seguran&ccedil;a ou de conformidade.</li>
	<li><strong>AMBIENTE LOCAL:</strong> passe o fardo de hardware, seguran&ccedil;a, desempenho e escalabilidade para a equipe e o or&ccedil;amento de TI. Esta op&ccedil;&atilde;o oferece controle total e todas as dores de cabe&ccedil;a que acompanham a responsabilidade por toda a infraestrutura de com&eacute;rcio eletr&ocirc;nico.</li>
	<li><strong>H&Iacute;BRIDO:</strong> combina hardware no local ou dedicado com recursos de nuvem para atingir efici&ecirc;ncias de nuvem e atender a determinadas necessidades de seguran&ccedil;a ou de conformidade. Em um <a href="http://www.rackspace.com/pt/cloud/hybrid/">ambiente de nuvem h&iacute;brida</a>, um varejista pode transferir determinadas cargas de trabalho, como e-mail ou fornecimento de conte&uacute;do, para a nuvem, mantendo o controle sobre outros sistemas cr&iacute;ticos que s&atilde;o mais bem executados em equipamento dedicado ou no local.</li>
</ul>

<p>"N&atilde;o consigo pensar em um cen&aacute;rio em que a solu&ccedil;&atilde;o "totalmente local" seria a ideal", diz Gandhe. "Com essa op&ccedil;&atilde;o, voc&ecirc; tem provis&atilde;o para per&iacute;odos de pico &ndash; ou seja, voc&ecirc; est&aacute; investindo excessivamente em capacidade para outros per&iacute;odos &ndash; ou para o tr&aacute;fego normal di&aacute;rio, correndo o risco de n&atilde;o atender aos picos de demanda".</p>

<p>Steve Vitale, diretor de com&eacute;rcio eletr&ocirc;nico da Spencer Gifts, reafirma a declara&ccedil;&atilde;o de Gandhe: "Nosso tr&aacute;fico e neg&oacute;cios podem aumentar de 100 a 1.000 vezes de seu tamanho no per&iacute;odo de entressafra. Temos de expandir e diminuir, mas tamb&eacute;m temos de tentar n&atilde;o dispor de muita infraestrutura no per&iacute;odo de entressafra. &Eacute; por isso que escolhemos a nuvem h&iacute;brida Rackspace baseada em RackConnect. Dividimos nossa aplica&ccedil;&atilde;o entre uma infraestrutura dedicada privada para o nosso processo de compra e usamos a nuvem p&uacute;blica para descri&ccedil;&otilde;es de produtos, pre&ccedil;os e outras informa&ccedil;&otilde;es".</p>

<h3>A MUDAN&Ccedil;A</h3>

<p>Com base no conhecimento e experi&ecirc;ncia adquiridos no atendimento a alguns dos maiores varejistas dos EUA, a <a href="http://www.rackspace.com/pt/digital">Rackspace Digital</a>, uma tecnologia especializada em <a href="http://go.rackspace.com/digital#content-target">gerenciamento de conte&uacute;do</a>, <a href="http://go.rackspace.com/digital#mobile-target">dispositivos m&oacute;veis</a> e <a href="http://go.rackspace.com/digital#commerce-target">hospedagem de com&eacute;rcio eletr&ocirc;nico</a>, desenvolveu quatro arquiteturas de refer&ecirc;ncia para solu&ccedil;&otilde;es de com&eacute;rcio eletr&ocirc;nico constru&iacute;das em <a href="http://ptrackspace.convertlanguage.com/pt/ecommerce-hosting/magento/">Magento </a>ou <a href="http://ptrackspace.convertlanguage.com/pt/oracle-retail">Oracle Retail</a>:</p>

<ul>
	<li><strong>B&Aacute;SICA:</strong> uma configura&ccedil;&atilde;o de nuvem pura com servidor web e banco de dados que residem na nuvem, com a capacidade de adicionar servidores web e banco de dados para proporcionar escalabilidade.</li>
	<li><strong>INTERMEDI&Aacute;RIO:</strong> arquitetura baseada em nuvem de tr&ecirc;s camadas utilizando servidores dedicados tanto para servidores web e de base de dados. Servidores web e de banco de dados &uacute;nicos ficam segmentado por tr&aacute;s do firewall f&iacute;sico, e as informa&ccedil;&otilde;es do cart&atilde;o de cr&eacute;dito do cliente s&atilde;o armazenadas em um gateway de pagamento de terceiros.</li>
	<li><strong>AVAN&Ccedil;ADA:</strong> uma arquitetura de tr&ecirc;s camadas h&iacute;brida (dedicado + em nuvem) que se baseia em dados transacionais armazenados em servidores dedicados por tr&aacute;s de um firewall f&iacute;sico, com a capacidade de passar para Cloud Servers em picos de feriados ou aumentos repentinos na carga.</li>
	<li><strong>PREMIER:</strong> arquitetura de tr&ecirc;s camadas autossuficiente h&iacute;brida (dedicado + em nuvem) e compat&iacute;vel com PCI, projetada para suportar o maior n&uacute;mero de transa&ccedil;&otilde;es on-line atrav&eacute;s de uma infraestrutura resistente e altamente dispon&iacute;vel com recursos de failover em todas as camadas da solu&ccedil;&atilde;o.</li>
</ul>

<h3>O QUE &Eacute; A RACKSPACE DIGITAL?</h3>

<p>Melhores pr&aacute;ticas, orienta&ccedil;&atilde;o de arquitetura e suporte proativo &agrave;s principais plataformas digitais para:</p>

<ul>
	<li><strong>SISTEMAS DE GEST&Atilde;O DE CONTE&Uacute;DO WEB:</strong> experi&ecirc;ncia de hospedagem de aplica&ccedil;&atilde;o e infraestrutura para as principais plataformas WCMS, incluindo WordPress, Drupal, Sitecore, Adobe e Ektron.</li>
	<li><strong>SOLU&Ccedil;&Otilde;ES DE COM&Eacute;RCIO ELETR&Ocirc;NICO:</strong> infraestrutura e servi&ccedil;os abertos e h&iacute;bridos para a cria&ccedil;&atilde;o de lojas de com&eacute;rcio eletr&ocirc;nico seguras, escal&aacute;veis &ZeroWidthSpace;&ZeroWidthSpace;e altamente dispon&iacute;veis criadas em Magento, Oracle Commerce, hybris e Intershop.</li>
	<li><strong>SERVI&Ccedil;OS DE DISPOSITIVOS M&Oacute;VEIS:</strong> infraestrutura flex&iacute;vel para dispositivo m&oacute;vel e experi&ecirc;ncia em hospedagem de plataforma em Node.js, FeedHenry, e Mutual Mobile para experi&ecirc;ncias com dispositivos m&oacute;veis altamente escal&aacute;veis e confi&aacute;veis.</li>
</ul>

<h3><strong>REUNINDO TUDO</strong></h3>

<p>Uma loja on-line &eacute; a janela de uma empresa para o mundo. Ela precisa enfrentar o tr&aacute;fego di&aacute;rio e picos inesperados, al&eacute;m de oferecer aos clientes um local seguro para fazer compras. Um componente fundamental, obviamente, &eacute; permitir que os clientes fa&ccedil;am compras usando cart&otilde;es de cr&eacute;dito. Se o n&uacute;mero de transa&ccedil;&otilde;es de cart&atilde;o de cr&eacute;dito &eacute; relativamente pequeno, um gateway de pagamento de terceiros &eacute; econ&ocirc;mico e pode ser a melhor op&ccedil;&atilde;o. Se, no entanto, o volume de transa&ccedil;&otilde;es de cart&atilde;o de cr&eacute;dito for muito alto, pode ser mais econ&ocirc;mico armazenar informa&ccedil;&otilde;es de cart&atilde;o de cr&eacute;dito no centro de dados de um provedor de servi&ccedil;os capaz de atender aos <a href="www.rackspace.com/pt/ecommerce-hosting/pci/">requisitos de conformidade com o PCI</a>.</p>

<p>A l&oacute;gica de exibi&ccedil;&atilde;o de cat&aacute;logo e a l&oacute;gica do carrinho de compras podem residir no mesmo servidor, em uma arquitetura de duas camadas: a primeira camada &eacute; composta por uma camada web e de aplica&ccedil;&atilde;o combinadas; a segunda, de uma camada de base de dados. Outra op&ccedil;&atilde;o &eacute; uma arquitetura de tr&ecirc;s camadas. Nesse caso, a camada web &eacute; a primeira camada, a camada de app &eacute; a segunda, e a camada de banco de dados &eacute; a terceira.</p>

<p>"Geralmente consideramos que as opera&ccedil;&otilde;es de com&eacute;rcio eletr&ocirc;nico come&ccedil;am com uma arquitetura de duas camadas. Depois, &agrave; medida que o neg&oacute;cio cresce, come&ccedil;a a separa&ccedil;&atilde;o das duas camadas, de modo que cada camada possa ser dimensionada de forma independente", explica Gandhe. "Decidir entre uma arquitetura de refer&ecirc;ncia de duas ou tr&ecirc;s camadas realmente depende das necessidades de escalabilidade para exibi&ccedil;&atilde;o de cat&aacute;logo e carrinho de compras".</p>

<p>As l&oacute;gicas de exibi&ccedil;&atilde;o e de carrinho de compras podem rodar em <a href="http://www.rackspace.com/pt/cloud/servers/">Cloud Servers</a> ou <a href="http://www.rackspace.com/pt/managed_hosting/dedicated_servers/">servidores dedicados</a>. A nuvem &eacute; persistente e altamente el&aacute;stica, com provisionamento r&aacute;pido para expans&atilde;o sob demanda. Servidores dedicados, por outro lado, proporcionam um ambiente de &uacute;nico inquilino para uso exclusivo.</p>

<p>O tipo de banco de dados e volume de opera&ccedil;&otilde;es de E/S ditar&atilde;o qual a tecnologia de banco de dados &eacute; adequada para as opera&ccedil;&otilde;es de com&eacute;rcio eletr&ocirc;nico. "Os Cloud Databases s&atilde;o a melhor op&ccedil;&atilde;o, se voc&ecirc; quiser usar um banco de dados MySQL e que a Rackspace o gerencie para voc&ecirc; ", diz Gandhe. "Se voc&ecirc; quiser usar um banco de dados que suporta ambientes virtuais, ent&atilde;o voc&ecirc; pode administrar o seu pr&oacute;prio banco de dados nos Cloud Servers. Se o banco de dados de sua escolha n&atilde;o suporta virtualiza&ccedil;&atilde;o, ou, se desejar o melhor desempenho de E/S, recomendamos a execu&ccedil;&atilde;o do banco de dados em um servidor dedicado".</p>

<h3><strong>CONCLUS&Atilde;O</strong></h3>

<p>Em &uacute;ltima an&aacute;lise, a replataforma&ccedil;&atilde;o de um sistema de com&eacute;rcio eletr&ocirc;nico se resume a determinar os investimentos necess&aacute;rios para atingir as metas da organiza&ccedil;&atilde;o. Fatores como o padr&atilde;o de demanda, <a href="http://www.rackspace.com/pt/enterprise-cloud-solutions/advisory-services/#tco-workshop">custo total de propriedade</a> e custos de transforma&ccedil;&atilde;o precisam ser considerados em qualquer an&aacute;lise financeira de uma solu&ccedil;&atilde;o em potencial. Escolher o software da plataforma de com&eacute;rcio eletr&ocirc;nico equilibra o custo de licenciamento e gest&atilde;o em rela&ccedil;&atilde;o ao benef&iacute;cio de acesso imediato &agrave;s ferramentas necess&aacute;rias para criar e expandir um site competitivo. A variabilidade suficiente na demanda &eacute; necess&aacute;ria para obten&ccedil;&atilde;o de economia de custo atrav&eacute;s de um modelo de hospedagem em nuvem p&uacute;blica. Cargas de trabalho simples s&atilde;o mais baratas em infraestrutura dedicada ao longo de um prazo de contato fixo.</p>

<p>A transforma&ccedil;&atilde;o da infraestrutura pode ser cara e demorada, e contar com compet&ecirc;ncias internas pode n&atilde;o ser o ideal. "Em quase todos os casos, eu recomendo fortemente que a empresa que considera a replataforma&ccedil;&atilde;o examine a possibilidade de trabalhar com um parceiro capaz de aplicar habilidades e recursos que, provavelmente, faltem internamente", diz Gande.</p>

<h3>SAIBA MAIS SOBRE AS SOLU&Ccedil;&Otilde;ES DA RACKSPACE DIGITAL EM <a href="http://www.rackspace.com/pt/digital">IR.RACKSPACE.COM/DIGITAL</a></h3>

<h3>&nbsp;</h3>

<p><strong>Sources:</strong></p>

<p><sup>1</sup> <a href="http://googlemobileads.blogspot.com/2012/09/mobile-friendly-sites-turn-visitors.html%20">http://googlemobileads.blogspot.com/2012/09/mobile-friendly-sites-turn-visitors.html </a></p>

<p><sup>2</sup> <a href="http://blogs.forrester.com/peter_sheldon/13-08-01-commerce_technology_continues_its_%20bull_run">http://blogs.forrester.com/peter_sheldon/13-08-01-commerce_technology_continues_its_ bull_run</a></p>

<p><sup>3</sup> <a href="http://www.slideshare.net/Carnage3604/forrester-tco-comparison">Understanding TCO When Evaluating Ecommerce Platforms, 2012, Forrester Research.</a></p>

<p><sup>4</sup> <a href="http://www.slideshare.net/Carnage3604/forrester-tco-comparison">Understanding TCO When Evaluating Ecommerce Platforms, 2012, Forrester Research.</a></p>

<p><sup>5</sup> <a href="http://www.slideshare.net/Carnage3604/forrester-tco-comparison">Understanding TCO When Evaluating Ecommerce Platforms, 2012, Forrester Research.</a></p>

<p><sup>6</sup> <a href="http://www.emarketer.com/Article/Smartphones-Tablets-Drive-Faster-Growth-Ecommerce-%20Sales/1009835">http://www.emarketer.com/Article/Smartphones-Tablets-Drive-Faster-Growth-Ecommerce- Sales/1009835</a></p>

<p><sup>7</sup> <a href="http://success.adobe.com/assets/en/downloads/whitepaper/13926_di_social_sentiment_%20v10.pdf">http://success.adobe.com/assets/en/downloads/whitepaper/13926_di_social_sentiment_ v10.pdf</a></p>
rrester-tco-comparison">Understanding TCO When Evaluating Ecommerce Platforms, 2012, Forrester Research.</a></p>

<p><sup>6</sup> <a href="http://www.emarketer.com/Article/Smartphones-Tablets-Drive-Faster-Growth-Ecommerce-%20Sales/1009835">http://www.emarketer.com/Article/Smartphones-Tablets-Drive-Faster-Growth-Ecommerce- Sales/1009835</a></p>

<p><sup>7</sup> <a href="http://success.adobe.com/assets/en/downloads/whitepaper/13926_di_social_sentiment_%20v10.pdf">http://success.adobe.com/assets/en/downloads/whitepaper/13926_di_social_sentiment_ v10.pdf</a></p>
