---
node_id: 3636
title: PCI Compliance in Rackspace Hybrid Cloud
type: whitepaper
created_date: '2013-08-06'
created_by: Rackspace Support
last_modified_date: '2015-07-21'
last_modified_by: Max Francisco
product: White Paper
product_url: white-paper
resource: 'https://8026b2e3760e2433679c-fffceaebb8c6ee053c935e8915a3fbe7.ssl.cf2.rackcdn.com/whitepaper_pdf/PCI_Compliance_Rackspace_Hybrid_Cloud.pdf'
---

<p>Autores:<br />
Mahesh Gande, director s&eacute;nior de soluciones<br />
Francis Ofungwu, gerente de productos de soluciones de seguridad de Rackspace<br />
Jarret Raim, gerente de productos de seguridad en la nube de Rackspace<br />
Lizetta Staplefoote, estratega de contenido en l&iacute;nea</p>

<p><strong>1. INTRODUCCI&Oacute;N</strong></p>

<p>Trabajar con la industria de tarjetas de pago: las normas de seguridad de datos (PCI-DSS) pueden ser un ejercicio complejo y costoso para los minoristas de comercio electr&oacute;nico promedio. Esto puede explicar por qu&eacute; el 96% de las v&iacute;ctimas por incumplimiento en el 2011 fall&oacute; en la &uacute;ltima evaluaci&oacute;n o nunca se ha validado.<sup>1</sup></p>

<p>No existe un mismo enfoque para todos en cuanto a lograr y mantener el cumplimiento de las normas. Los comerciantes sin la experiencia para ejecutar un programa efectivo de cumplimiento de normas deben buscar la orientaci&oacute;n de parte de socios externos para complementar las carencias de conocimiento y las deficiencias de infraestructura.</p>

<p><strong>2. LOS 12 REQUISITOS DEL CUMPLIMIENTO DE NORMAS PCI-DSS</strong></p>

<p>PCI-DSS es un conjunto de requisitos generales para mejorar la seguridad de datos de la cuenta de pago. La norma fue desarrollada por el PCI Security Standards Council, que incluye American Express, Discover Financial Services, JCB International, MasterCard Worldwide y Visa para ayudar a facilitar la amplia adopci&oacute;n de medidas coherentes de seguridad de datos en una base global.<br />
<br />
El <strong><em>82% de las operaciones que han incumplido no obedecieron las nomas de PCI-DSS para la protecci&oacute;n de datos almacenados</em></strong><sup><strong><em>2</em></strong></sup></p>

<p>El cumplimiento de normas PCI se divide en 12 pasos dentro de las seis categor&iacute;as de protecci&oacute;n:</p>

<p><strong>1. Crear y mantener una red segura</strong><br />
<br />
<strong>&bull; Requisito 1:</strong> Instalar y mantener una configuraci&oacute;n de firewall para proteger los datos de los titulares.<br />
Establece las normas de firewall y de configuraci&oacute;n del enrutador que exigen pruebas, procedimientos de prueba y una revisi&oacute;n de la norma de configuraci&oacute;n se establece cada seis meses.</p>

<p><strong>&bull; Requisito 2:</strong> No utilizar las opciones predeterminadas del proveedor para configurar contrase&ntilde;as del sistema y otros par&aacute;metros de seguridad.<br />
Aborda la limpieza de contrase&ntilde;as con respecto a las contrase&ntilde;as proporcionadas por los proveedores, que al combinarse con herramientas de hackers que puedan mostrar todos sus dispositivos en red puede convertirlo en una presa f&aacute;cil para la entrada no autorizada.</p>

<p><strong>2. Proteger los datos de los titulares</strong><br />
<br />
<strong>&bull; Requisito 3:</strong> Proteger los datos almacenados de los titulares de tarjetas<br />
Define el almacenamiento, la codificaci&oacute;n y la retenci&oacute;n de los datos de los titulares y los datos de autenticaci&oacute;n para los usos comerciales requeridos. Tambi&eacute;n cubre la documentaci&oacute;n y protecci&oacute;n de las claves utilizadas para codificar los datos de titulares.</p>

<p><img alt="" height="211" src="https://8026b2e3760e2433679c-fffceaebb8c6ee053c935e8915a3fbe7.ssl.cf2.rackcdn.com/new1.png" width="434" /></p>

<p><strong>&bull; Requisito 4:</strong> Codificar la transmisi&oacute;n de los datos de los titulares a trav&eacute;s de redes p&uacute;blicas y abiertas<br />
Se refiere a la implementaci&oacute;n de s&oacute;lidos protocolos de criptograf&iacute;a y seguridad, como SSL/TLS, SSH o IPSec para proteger los datos delicados de los titulares durante la transmisi&oacute;n de redes p&uacute;blicas abiertas (Internet y m&oacute;vil). Adem&aacute;s, las redes inal&aacute;mbricas que transmiten datos de los titulares o conectadas al entorno de los datos de los titulares deben utilizar las mejores pr&aacute;cticas de la industria para implementar una codificaci&oacute;n s&oacute;lida para la autenticaci&oacute;n y transmisi&oacute;n.</p>

<p><strong>3. Mantener un programa de administraci&oacute;n de vulnerabilidades</strong><br />
<br />
<strong>&bull; Requisito 5:</strong> Usar y actualizar regularmente software o programas antivirus<br />
Cualquier sistema que pueda verse afectado por malware debe ser protegido con el software de antivirus actual que funciona de manera activa y genera registros de auditor&iacute;a.</p>

<p><strong>&bull; Requisito 6:</strong> Desarrollar y mantener sistemas y aplicaciones de seguridad<br />
El c&oacute;digo de aplicaci&oacute;n debe ajustarse a las pautas de codificaci&oacute;n segura que incluyen la revisi&oacute;n de la aplicaci&oacute;n personalizada y el c&oacute;digo externo para identificar las vulnerabilidades.</p>

<p><strong>4. Implementar medidas firmes de control de acceso </strong></p>

<p><strong><strong>&bull; </strong>Requisito 7:</strong>Limitar el acceso a los componentes del sistema y a los datos de titulares, solo a aquellas personas cuyas tareas necesitan de ese acceso<br />
Para proteger los datos cr&iacute;ticos del acceso por parte de personal no autorizado dentro y fuera de la empresa, deben existir sistemas y procesos documentados para restringir el acceso a los datos de los titulares utilizando controles de acceso basados &ZeroWidthSpace;&ZeroWidthSpace;en roles (RBAC, por sus siglas en ingl&eacute;s) configurados en "denegar todo", a menos que se conceda espec&iacute;ficamente el acceso a los datos y los sistemas de los de los titulares.</p>

<p><strong>&bull; Requisito 8:</strong> Asignar una identificaci&oacute;n &uacute;nica<br />
Cualquier usuario al que le conceda acceso a los datos de titulares deber&aacute; tener una identificaci&oacute;n &uacute;nica para que las medidas tomadas en los datos y sistemas cr&iacute;ticos sean implementadas y puedan ser rastreadas por usuarios conocidos y autorizados. Este requisito tambi&eacute;n incluye disposiciones sobre el uso de la autenticaci&oacute;n de dos factores a trav&eacute;s del token y el almacenamiento de las contrase&ntilde;as de usuario.</p>

<p><strong>&bull; Requisito 9:</strong> Restringir el acceso f&iacute;sico a los datos de los titulares<br />
Para proteger de los medios f&iacute;sicos que contienen datos de los titulares que son eliminados o est&aacute;n en riesgo, &aacute;reas donde dispositivos, datos, sistemas o copias en papel de los datos de titulares deben ser restringidas al acceso general. Esto se aplica tanto a los sistemas electr&oacute;nicos de todos los comerciantes en l&iacute;nea y recibos en papel como a los sistemas de punto de venta y establecimientos tradicionales.</p>

<p><strong>5. Monitorear y probar las redes regularmente</strong><br />
<br />
<strong>&bull; Requisito 10:</strong> Hacer un seguimiento de y monitorear todo acceso a los recursos de red y a los datos de titulares<br />
Los mecanismos de registro y la capacidad de hacer un seguimiento de las actividades del usuario son importantes para el an&aacute;lisis forense y la gesti&oacute;n de vulnerabilidades adecuados. Los registros deben chequear las acciones espec&iacute;ficas y crear una pista de auditor&iacute;a, que incluyen, como m&iacute;nimo: identificaci&oacute;n del usuario, tipo de evento, fecha y hora, indicios de &eacute;xito o fallo, origen del evento e identidad o nombre de los datos, componentes del sistema o recursos afectados. Se deben revisar estos registros diariamente y conservar las pistas de auditor&iacute;a durante al menos un a&ntilde;o.</p>

<p><strong>&bull; Requisito 11:</strong> Evaluar regularmente los sistemas y procesos de seguridad<br />
Ejecutar los an&aacute;lisis de vulnerabilidad de las redes internas y externas, al menos trimestralmente y despu&eacute;s de cualquier cambio importante en la red o infraestructura, la actualizaci&oacute;n o modificaci&oacute;n de la aplicaci&oacute;n. Despu&eacute;s de aprobar el an&aacute;lisis inicial de cumplimiento de normas, los comerciantes tienen que aprobar otros cuatro an&aacute;lisis trimestrales consecutivos de un proveedor de an&aacute;lisis aprobado (ASV, por sus siglas en ingl&eacute;s) como requisito para el cumplimiento de normas. Esta disposici&oacute;n tambi&eacute;n incluye el uso de sistemas de detecci&oacute;n de intrusiones (IDS, por sus siglas en ingl&eacute;s) actualizados y herramientas de monitoreo de la integridad de archivos para comprobar y alertar al sistema de una modificaci&oacute;n en riesgo o no autorizada de los archivos indispensables.</p>

<p><em><strong>Solo el 6% de las organizaciones que han incumplido informaron tener pruebas y procesos regulares de los sistemas de seguridad.<sup>3</sup></strong></em></p>

<p><strong>6. Mantener una pol&iacute;tica de seguridad de la informaci&oacute;n </strong></p>

<p><strong><strong>&bull; </strong>Requisito 12:</strong> Mantener una pol&iacute;tica que aborde la seguridad de la informaci&oacute;n para todo el personal</p>

<p>Establecer, publicar, actualizar y difundir una pol&iacute;tica de seguridad que aborde los requisitos de cumplimiento de normas. Esta pol&iacute;tica debe incluir un proceso de revisi&oacute;n anual para identificar las vulnerabilidades y evaluar formalmente los riesgos. Tambi&eacute;n se requieren pol&iacute;ticas de uso definidas para selecci&oacute;n de empleados, acceso remoto, inal&aacute;mbrico, medios electr&oacute;nicos extra&iacute;bles, laptops, tablets, dispositivos port&aacute;tiles, correo electr&oacute;nico e Internet.</p>

<p><strong>3. &iquest;QUI&Eacute;N NECESITA EL CUMPLIMIENTO DE NORMAS PCI-DSS?</strong></p>

<p>Si su empresa cumple con cualquiera de estos criterios, usted debe tener una estrategia PCI-DSS en el lugar:<br />
<br />
&bull; &iquest;Almacena, procesa o transmite datos de los titulares*?<br />
&bull; &iquest;Proporciona servicios a los comerciantes que procesan, almacenan o transmiten datos de los titulares*?<br />
*Hace referencia a un PAN (n&uacute;mero de cuenta primario) adem&aacute;s del nombre del titular, fecha de vencimiento, c&oacute;digo de servicio</p>

<p><strong>Comprender los niveles comerciales y los tipos de validaci&oacute;n PCI-DSS</strong></p>

<p>El proceso y la frecuencia del cumplimiento de normas de validaci&oacute;n con estos 12 pasos est&aacute;n determinados por su nivel comercial y los tipos de evaluaci&oacute;n de seguridad que se detallan a continuaci&oacute;n:</p>

<p><img alt="" height="195" src="https://8026b2e3760e2433679c-fffceaebb8c6ee053c935e8915a3fbe7.ssl.cf2.rackcdn.com/pci2a.png" width="499" /></p>

<p>Su tipo de validaci&oacute;n determina qu&eacute; SAQ debe completar.</p>

<p><img alt="" height="220" src="https://8026b2e3760e2433679c-fffceaebb8c6ee053c935e8915a3fbe7.ssl.cf2.rackcdn.com/pci3a.png" width="502" /><br />
*Esto es un ejemplo de las clasificaciones de la marca de la tarjeta VISA. Existen otras normas de la industria.</p>

<p><strong>&iquest;Por qu&eacute; es importante el cumplimiento de normas?</strong></p>

<p>El incumplimiento de normas PCI-DSS puede conducir a:<br />
&bull; P&eacute;rdida de la reputaci&oacute;n<br />
&bull; Aumento de los costos para la aceptaci&oacute;n de transacciones con tarjeta de cr&eacute;dito<br />
&bull; Multas considerables asociadas con las violaciones a y el incumplimiento de la seguridad</p>

<p>En caso de que ocurra una violaci&oacute;n como resultado de un incumplimiento, hay costos de b&uacute;squeda y control para investigar el incidente, gastos de compensaci&oacute;n, honorarios de abogados y costas judiciales adem&aacute;s de:</p>

<p>&bull; P&eacute;rdida de confianza del cliente<br />
&bull; P&eacute;rdida de ventas e ingresos<br />
&bull; Degradaci&oacute;n de la marca o ca&iacute;da de valor p&uacute;blico en la bolsa<br />
&bull; Multas y sanciones por incumplimiento de normas PCI-DSS<br />
&bull; Terminaci&oacute;n de la capacidad de aceptar tarjetas de pago<br />
&bull; P&eacute;rdidas por fraude<br />
&bull; Costo de emisi&oacute;n de nuevas tarjetas de pago<br />
&bull; Costos de resoluci&oacute;n de disputas<br />
&bull; Costos de acuerdos legales o juicios</p>

<p><img alt="" height="369" src="https://8026b2e3760e2433679c-fffceaebb8c6ee053c935e8915a3fbe7.ssl.cf2.rackcdn.com/pci4a.png" width="551" /></p>

<p><strong>Asociaci&oacute;n para el cumplimientos de normas PCI-DSS</strong></p>

<p>Debido a la complejidad y necesidad de mantener PCI-DSS, muchos comerciantes optan por conseguir socios de soluciones para proporcionar las herramientas necesarias para crear los elementos para la infraestructura del cumplimiento de normas.</p>

<p>Aun habiendo socios involucrados, el cumplimiento de normas PCI-DSS es una responsabilidad doble compartida por usted y su proveedor. El hospedaje con un proveedor que ofrece la infraestructura del cumplimiento de normas PCI-DSS no significa que usted cumpla de manera autom&aacute;tica. Por ejemplo, un simple error de codificaci&oacute;n puede dejar a un negocio abierto para la explotaci&oacute;n, incluso aunque se tengan importantes socios de hospedaje y seguridad. Como puede ver a continuaci&oacute;n, cada entidad tiene una responsabilidad:</p>

<p><img alt="" height="276" src="https://8026b2e3760e2433679c-fffceaebb8c6ee053c935e8915a3fbe7.ssl.cf2.rackcdn.com/PCI23.png" width="502" /></p>

<p><strong>4. LOGRAR EL CUMPLIMIENTO DE NORMAS PCI-DSS</strong></p>

<p><strong>Preguntas para hacer:</strong></p>

<p>1. &iquest;Su banco ha hablado con usted acerca de PCI-DSS o estipulado una fecha en la que exigen el cumplimiento de normas? Por qu&eacute; es importante: puede determinar cu&aacute;n exigente debe ser su programa de cumplimiento de normas.</p>

<p>2. &iquest;Ha hablado con su adquiriente sobre el cumplimiento de normas PCI-DSS? Por qu&eacute; es importante: el adquiriente generalmente es responsable del cumplimiento de normas del comerciante</p>

<p>3. &iquest;A qu&eacute; programa de cumplimiento de normas de marca de pago se subscribir&aacute; (AMeX, Discover, JCB, Master- Card, Visa)? Por qu&eacute; es importante: cada marca de pago tiene sus propios requisitos de validaci&oacute;n</p>

<p>4. &iquest;Qu&eacute; cuestionario de autoevaluaci&oacute;n completar&aacute;? Por qu&eacute; es importante: busque ayuda de un asesor de seguridad calificado (QSA, por sus siglas en ingl&eacute;s) para determinar qu&eacute; cuestionario de <a href="https://www.pcisecuritystandards.org/merchants/self_assessment_form.php">autoevaluaci&oacute;n de PCI Data Security Standard</a> se ajusta a sus procesos comerciales.</p>

<p>5. &iquest;Usted es un proveedor de servicios, comerciante o ambos? Por qu&eacute; es importante: para determinar qu&eacute; requisitos de validaci&oacute;n se aplican a su empresa.</p>

<p>6. &iquest;Tiene recursos internos para impulsar el cumplimiento de normas? Por qu&eacute; es importante: para identificar las carencias y evaluar d&oacute;nde los socios aportan m&aacute;s valor.</p>

<p><strong>Opciones disponibles:</strong></p>

<p>El pilar de PCI-DSS es la protecci&oacute;n de datos. Las pol&iacute;ticas de su compa&ntilde;&iacute;a y el volumen de transacciones con tarjetas de cr&eacute;dito, junto con otros factores comerciales que no se discuten aqu&iacute;, deben servir como gu&iacute;a en cuanto al lugar donde decide almacenar estos datos y la forma de protegerlos. Opciones para explorar:</p>

<p><strong>&bull; Almacenar datos de tarjetas de cr&eacute;dito en un proveedor que ofrece la infraestructura del cumplimiento de normas PCI-DSS.</strong></p>

<p><strong>&bull; Almacenar informaci&oacute;n de tarjeta de cr&eacute;dito utilizando una pasarela de pago externo que transmita el lado del servidor de datos mediante las API. Recopilan los datos y los env&iacute;an codificados a sus servidores.</strong></p>

<p><img alt="" height="103" src="https://8026b2e3760e2433679c-fffceaebb8c6ee053c935e8915a3fbe7.ssl.cf2.rackcdn.com/pci5a.png" width="499" /></p>

<p>C&oacute;mo funciona:</p>

<p>1. Con la solicitud del cliente a facturaci&oacute;n, se muestra a su cliente un formulario para recopilar la informaci&oacute;n de pago requerida. Cuando el cliente env&iacute;a el formulario, se codifican los datos y luego se env&iacute;an a sus servidores.</p>

<p>2. Mediante la biblioteca del cliente, se realiza una llamada servidor a servidor (S2S) a la pasarela de pago a fin de completar el procesamiento de la transacci&oacute;n.</p>

<p>3. La pasarela de pago procesa la transacci&oacute;n y devuelve una respuesta a su servidor.</p>

<p>4. Esta respuesta se puede utilizar para mostrar datos relevantes para el cliente en el navegador, como el estado de la transacci&oacute;n.</p>

<p><strong>&bull; Almacenar informaci&oacute;n de la tarjeta de cr&eacute;dito usando una pasarela de pago externa que transmita los datos desde el navegador del cliente antes de llegar a su servidor.</strong></p>

<p><img alt="" height="287" src="https://8026b2e3760e2433679c-fffceaebb8c6ee053c935e8915a3fbe7.ssl.cf2.rackcdn.com/pci6a.png" width="311" /></p>

<p>C&oacute;mo funciona:</p>

<p>1. Con la solicitud del cliente a facturaci&oacute;n, se muestra a su cliente un formulario para recopilar la informaci&oacute;n de pago requerida. Cuando el cliente env&iacute;a el formulario, los datos se publican directamente en la pasarela de pago a trav&eacute;s de una conexi&oacute;n SSL.</p>

<p>2. Luego la pasarela de pago almacena los datos. Debido a que la pasarela de pago redirecciona el cliente a su sitio sin mostrar ning&uacute;n contenido, el cliente incluso nunca sabe que ha abandonado su sitio.</p>

<p>3. El navegador del cliente solicita el URL al que se redirigi&oacute; desde su sitio. La cadena de consultas para el URL requerido contiene un token que identifica los datos almacenados desde el Paso 1.</p>

<p>4. Mediante la biblioteca del cliente, usted realiza una llamada servidor a servidor (S2S) a la pasarela de pago a fin de completar el procesamiento de la solicitud. Este paso confirma que si el cliente no completa la redirecci&oacute;n a su sitio, la pasarela de pago no completar&aacute; la transacci&oacute;n.</p>

<p>5. Despu&eacute;s de recibir la solicitud de confirmaci&oacute;n, la pasarela de pago ejecutar&aacute; la transacci&oacute;n y enviar&aacute; una respuesta.</p>

<p><strong>Decidir entre almacenar datos internos o usar la pasarela de pago</strong></p>

<p>Compare el costo de utilizar una pasarela de pago externa con el costo de almacenar informaci&oacute;n de tarjetas de cr&eacute;dito en su centro de datos o centro de datos de un proveedor. Compare estos c&aacute;lculos para tomar una decisi&oacute;n:</p>

<p>&bull; Calcular el costo de los productos/servicios adicionales necesarios para almacenar los datos internos de tarjetas de cr&eacute;dito por mes. Rackspace puede ayudarle a crear configuraciones de muestra y proporcionar estimaciones sobre el costo.</p>

<p>&bull; Calcular el costo del uso de una pasarela de pago externa por mes = n&uacute;mero de transacciones * costo de la transacci&oacute;n cobrada por la pasarela de pago + ingresos en l&iacute;nea * % de los ingresos a pagar al proveedor de la pasarela de pago.</p>

<p>Si el almacenamiento de datos en el lugar es m&aacute;s costoso que la pasarela, considera la posibilidad de utilizar una. Si el uso de la pasarela de pago es m&aacute;s costoso o una pasarela externa es incompatible con otras pol&iacute;ticas de la compa&ntilde;&iacute;a, considere el almacenamiento de datos en un centro de datos que cumpla con PCI-DSS en servidores dedicados.</p>

<p><strong>Decidir entre transmitir datos desde el servidor o desde el navegador</strong></p>

<p>El uso de las API de los navegadores del cliente excluye la infraestructura de los servidores del alcance del cumplimiento de normas PCI-DSS, ya que todos los datos confidenciales se transmiten entre el usuario y la pasarela de pago.</p>

<p>Cuando usted elige transmitir la informaci&oacute;n de tarjetas de cr&eacute;dito desde el lado del servidor utilizando las API de la pasarela de pago externa, la infraestructura de su servidor ser&aacute; parte del cumplimiento de normas PCI-DSS, ya que los datos confidenciales se cruzan en su infraestructura.</p>

<p><strong>Soluci&oacute;n que cumple con las normas PCI-DSS para Rackspace Dedicated Hosting</strong></p>

<p>Ejemplo de la arquitectura de referencia que cumple con las normas PCI-DSS sin una pasarela de pago:</p>

<p><img alt="" height="319" src="http://f494fe00a131971608ff-3fb62eaa3f125e9bde603735b3681623.r27.cf1.rackcdn.com/security/security-sample-architecture.png" width="406" /></p>

<p>&nbsp;</p>

<p>Use esta tabla para alinear sus necesidades de cumplimiento de normas PCI-DSS con los servicios de Rackspace:</p>

<p><img alt="" height="817" src="https://8026b2e3760e2433679c-fffceaebb8c6ee053c935e8915a3fbe7.ssl.cf2.rackcdn.com/pci7a-chart1b.png" width="551" /></p>

<p><strong>&nbsp;</strong></p>

<p><strong>Soluci&oacute;n que cumple con las normas PCI para Rackspace Cloud Hosting</strong><img align="right" alt="" height="153" src="http://images.cdn.rackspace.com/solutions/ecommerce/pci-compliance.gif" width="324" /><br />
<br />
Cuando hospeda su ambiente con Rackspace, tambi&eacute;n puede inscribirse en un procesador de pago por separado que proporcione datos de tarjetas de cr&eacute;dito tokenizados con n&uacute;meros o "tokens" sin sentido. Cuando acepta un pago, los datos sin PCI-DSS se env&iacute;an a su ambiente hospedado de Rackspace, mientras que los datos de tarjetas de cr&eacute;dito tokenizados se env&iacute;an a su procesador de pagos.</p>

<p>Since your customers&rsquo; credit card data does not route to your Rackspace hosted infrastructure&mdash;only the payment processor&mdash;your Rackspace environment stays out of the scope of your PCI-DSS requirements.</p>

<p>Consulte los <a href="https://cloudtools.rackspace.com/home">socios de herramientas de la nube de Rackspace</a> para obtener servicios de pasarela de pago recomendados de Rackspace:</p>

<p><a href="https://cloudtools.rackspace.com/apps/757?1197262527"><img alt="" src="http://c386932.r32.cf1.rackcdn.com/app_resources/757/thumbs_112/img1875829224899302087.png" />Stripe</a> es una forma sencilla y f&aacute;cil de usar para el programador para aceptar pagos en l&iacute;nea. Stripe maneja las formas personalizadas de pago, tarjetas de almacenamiento, suscripciones y pagos directos.</p>

<p>&bull; La mejor opci&oacute;n para: programadores que dise&ntilde;an aplicaciones de pago mediante API<br />
&bull; Precio: 2.9% + 30&cent; por carga exitosa*<br />
<a href="https://cloudtools.rackspace.com/apps/757?1478916637">M&aacute;s</a></p>

<p>&nbsp;</p>

<p><br />
<a href="https://cloudtools.rackspace.com/apps/621?230940707"><img alt="" src="http://c386932.r32.cf1.rackcdn.com/app_resources/621/thumbs_112/img2786457282233237070.png" />Braintree</a> es una plataforma de pagos completamente integrada para aplicaciones m&oacute;viles y sitios web. El servicio proporciona cuenta de comerciante, pasarela de pago y almacenamiento recurrente de facturaci&oacute;n y de tarjetas de cr&eacute;dito, incluidos los pagos de un solo toque en SDK m&oacute;viles y la aceptaci&oacute;n de moneda extranjera.</p>

<p>&bull; La mejor opci&oacute;n para: programadores que dise&ntilde;an aplicaciones de pago mediante API<br />
&bull; Precio: 2.9% + 30&cent; por carga exitosa*<br />
<a href="https://cloudtools.rackspace.com/apps/621?230940707">M&aacute;s</a></p>

<p>&nbsp;</p>

<p><a href="https://cloudtools.rackspace.com/apps/791?163191746"><img alt="" src="http://c386932.r32.cf1.rackcdn.com/app_resources/791/thumbs_112/img6350419810339149849.png" /></a>Con cuentas activas de m&aacute;s de 123 millones en 190 mercados y 25 monedas en todo el mundo, <a href="https://cloudtools.rackspace.com/apps/791?163191746">PayPal</a> permite el comercio global a trav&eacute;s de dispositivos m&oacute;viles y en la tienda. El servicio cuenta con investigaci&oacute;n autom&aacute;tica de fraudes, pol&iacute;tica de protecci&oacute;n al vendedor y la opci&oacute;n de financiamiento BillMeLater&reg;.</p>

<p>&bull; La mejor opci&oacute;n para: manejo de monedas internacionales<br />
&bull; Precio: 2.9% + 30&cent; por carga exitosa*<br />
<a href="https://cloudtools.rackspace.com/apps/791?163191746">M&aacute;s</a></p>

<p>&nbsp;</p>

<address>*precios y caracter&iacute;sticas se&ntilde;alados a partir del escrito de este documento</address>

<p><strong>CONCLUSI&Oacute;N</strong></p>

<p>Un paso clave para un programa exitoso de cumplimiento de normas es el establecimiento de una gesti&oacute;n continua de personas, procesos y tecnolog&iacute;a. Es un error muy com&uacute;n para muchas organizaciones peque&ntilde;as y grandes creer que invertir exclusivamente en tecnolog&iacute;as resolver&aacute; sus requisitos de seguridad y cumplimiento de normas. Las tecnolog&iacute;as como firewalls, sistemas de detecci&oacute;n de intrusiones (IDS) y dispositivos de administraci&oacute;n de registros tienen un nivel de efectividad que depende de las personas que las instalan y administran y los procesos utilizados para hacerlo.</p>

<p>Esta es una lecci&oacute;n que Transport for London (TFL), responsable de la gesti&oacute;n de los servicios de transporte en la capital de Inglaterra, aprendi&oacute; al tratar de lograr el cumplimiento de normas PCI-DSS para su sistema de pago de viajes. El sistema procesaba hasta 40,000 visitas por d&iacute;a con m&aacute;s de 2.5 millones de usuarios registrados. Siendo una empresa que trabaja las 24 horas, los 365 d&iacute;as al a&ntilde;o, no pod&iacute;an arriesgarse al incumplimiento u otras operaciones de interrupci&oacute;n. Optaron por Rackspace para obtener las piezas del rompecabezas que necesitaban para lograr el <a href="http://www.rackspace.com/es/security/domains/#pci">cumplimiento completo de normas.</a> "Probablemente sea cierto que sin la ayuda considerable de Rackspace no podr&iacute;amos haber aprobado la auditor&iacute;a extremadamente estricta de PCI-DSS. Rackspace sin duda fue m&aacute;s all&aacute; de sus funciones para garantizar que todo sea perfecto para nosotros", afirm&oacute; Aingaran Somaskandarajah, l&iacute;der t&eacute;cnico de Oyster Card.</p>

<p>Permita que Rackspace sea su socio de confianza en el trayecto de PCI-DSS. Podemos ayudarle a navegar el laberinto con requisitos de infraestructura y soluciones que pueden ayudar a reducir el alcance y la complejidad de sus esfuerzos de cumplimiento. <a href="http://www.rackspace.com/es/ecommerce-hosting/pci/">Cont&aacute;ctenos hoy para hablar sobre sus necesidades o explorar ahora los servicios de cumplimiento de normas PCI-DSS.</a></p>

<p>&nbsp;</p>

<p><a href="http://www.rackspace.com/ecommerce-hosting/"><img alt="" src="https://8026b2e3760e2433679c-fffceaebb8c6ee053c935e8915a3fbe7.ssl.cf2.rackcdn.com/pci8a.png" /></a></p>

<p><strong>References:</strong></p>

<p><sup>1</sup> <a href="http://www.verizonenterprise.com/resources/reports/rp_data-breach-investigations-report-2012_en_xg.pdf%20">http://www.verizonenterprise.com/resources/reports/rp_data-breach-investigations-report-2012_en_xg.pdf </a><br />
<sup>2</sup> <a href="http://www.verizonenterprise.com/resources/reports/rp_data-breach-investigations-report-2012_en_xg.pdf%20">http://www.verizonenterprise.com/resources/reports/rp_data-breach-investigations-report-2012_en_xg.pdf </a><br />
<sup>3</sup> <a href="http://www.verizonenterprise.com/resources/reports/rp_data-breach-investigations-report-2012_en_xg.pdf%20">http://www.verizonenterprise.com/resources/reports/rp_data-breach-investigations-report-2012_en_xg.pdf </a><br />
<sup>4</sup> <a href="https://www.pcisecuritystandards.org/merchants/self_assessment_form.php">https://www.pcisecuritystandards.org/merchants/self_assessment_form.php</a><br />
<sup>5</sup> <a href="https://www.pcisecuritystandards.org/merchants/self_assessment_form.php">https://www.pcisecuritystandards.org/merchants/self_assessment_form.php</a><br />
<sup>6</sup> <a href="http://www.verizonenterprise.com/DBIR/2013/">http://www.verizonenterprise.com/DBIR/2013/</a></p>
